[
  {
    "date": "2026-02-02",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-02",
        "quote": "Your courage is your compass; let it guide you through uncertainty.",
        "loveScore": 89,
        "workScore": 91,
        "healthScore": 78,
        "lovePrediction": "Sparks fly when you least expect them today. Your magnetic energy draws someone special closer, creating a connection that feels both exciting and refreshingly new. Allow yourself to be vulnerable — it's your strength, not your weakness.",
        "workPrediction": "A competitive situation plays beautifully into your strengths. Channel your natural drive into focused action and you'll secure the outcome you've been working toward.",
        "luckyNumbers": [
          26,
          53,
          61,
          69,
          97
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-02",
        "quote": "Beauty surrounds those who take time to notice it.",
        "loveScore": 79,
        "workScore": 70,
        "healthScore": 93,
        "lovePrediction": "A romantic gesture doesn't need to be elaborate to be meaningful. Cook a meal, write a note, or simply sit quietly together — your love language speaks through care.",
        "workPrediction": "Your reliability earns you a significant opportunity at work. Someone in a position of influence has been quietly observing your consistency and is ready to reward it.",
        "luckyNumbers": [
          11,
          70,
          79,
          87,
          96
        ],
        "luckyColor": "#228B22"
      },
      "Gemini": {
        "date": "2026-02-02",
        "quote": "Embrace the duality — both sides of you are extraordinary.",
        "loveScore": 76,
        "workScore": 75,
        "healthScore": 95,
        "lovePrediction": "Your social energy attracts fascinating people today, and one connection feels particularly charged with romantic potential. Follow the thread of curiosity to see where it leads.",
        "workPrediction": "A writing, speaking, or communication-based project receives outstanding feedback. Your natural gift for words creates professional results that exceed expectations nicely.",
        "luckyNumbers": [
          28,
          55,
          66,
          89,
          92
        ],
        "luckyColor": "#00BCD4"
      },
      "Cancer": {
        "date": "2026-02-02",
        "quote": "Your empathy transforms wounds into wisdom.",
        "loveScore": 70,
        "workScore": 79,
        "healthScore": 86,
        "lovePrediction": "A romantic daydream from this morning may very well be reality by evening. Your feelings are magnetic today and they draw matching energy toward you effortlessly.",
        "workPrediction": "Your memory for people's preferences and history makes you exceptionally effective at client relationships today. This personal touch generates professional loyalty that translates into real success.",
        "luckyNumbers": [
          1,
          23,
          31,
          35,
          50
        ],
        "luckyColor": "#00BCD4"
      },
      "Leo": {
        "date": "2026-02-02",
        "quote": "Boldness and kindness together make you legendary.",
        "loveScore": 73,
        "workScore": 74,
        "healthScore": 72,
        "lovePrediction": "Your radiance is impossible to ignore today and romance is sparked by your generous, sun-bright energy. Someone is captivated by the way you light up every room you enter.",
        "workPrediction": "Your generosity with credit and praise motivates your team to remarkable heights. True leaders lift others up, and today you do this beautifully and effectively.",
        "luckyNumbers": [
          10,
          42,
          84,
          88,
          98
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-02",
        "quote": "Your mind is a finely tuned instrument of brilliance.",
        "loveScore": 71,
        "workScore": 71,
        "healthScore": 77,
        "lovePrediction": "A quiet evening of meaningful conversation reveals new layers in your relationship that thrill and deepen your connection. Your attention to detail makes your partner feel truly seen.",
        "workPrediction": "Your organizational skills bring order to a chaotic situation at work today, making the impossible feel manageable and earning you deep appreciation from your team.",
        "luckyNumbers": [
          27,
          28,
          73,
          77,
          86
        ],
        "luckyColor": "#228B22"
      },
      "Libra": {
        "date": "2026-02-02",
        "quote": "You find beauty in balance and balance in beauty.",
        "loveScore": 89,
        "workScore": 95,
        "healthScore": 84,
        "lovePrediction": "Balance in giving and receiving love creates the perfect romantic rhythm today. Allow yourself to receive as graciously as you give — your partner loves to cherish you too.",
        "workPrediction": "Partnership opportunities in your career sector open up today. Your collaborative nature and professional reputation attract exactly the kind of partner who will amplify your success.",
        "luckyNumbers": [
          8,
          36,
          50,
          54,
          90
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-02",
        "quote": "You see the soul of things and respond with wisdom.",
        "loveScore": 81,
        "workScore": 92,
        "healthScore": 80,
        "lovePrediction": "Your seductive energy is operating at full power today, drawing the right kind of attention from the right kind of people. Be intentional about where you direct this magnetic force.",
        "workPrediction": "A career transformation begins in earnest today as you take the first concrete step toward the professional life you've been envisioning. Your determination will carry you all the way.",
        "luckyNumbers": [
          6,
          18,
          81,
          88,
          90
        ],
        "luckyColor": "#DC143C"
      },
      "Sagittarius": {
        "date": "2026-02-02",
        "quote": "Dream big, aim true, and trust the trajectory.",
        "loveScore": 76,
        "workScore": 83,
        "healthScore": 84,
        "lovePrediction": "Love feels like the greatest adventure today and you embrace it with your signature enthusiasm. A new romantic possibility excites both your heart and your wanderlust.",
        "workPrediction": "Your ability to see the big picture saves a project that got lost in the details today. Your strategic perspective realigns the team and restores momentum impressively.",
        "luckyNumbers": [
          17,
          57,
          63,
          64,
          95
        ],
        "luckyColor": "#00BCD4"
      },
      "Capricorn": {
        "date": "2026-02-02",
        "quote": "Your discipline today is the freedom you'll enjoy tomorrow.",
        "loveScore": 84,
        "workScore": 82,
        "healthScore": 85,
        "lovePrediction": "Vulnerability in love does not compromise your strength; it elevates it. Sharing your deeper feelings with a trusted partner today creates a bond that will last decades.",
        "workPrediction": "Your reputation for reliability brings an important new responsibility your way today. The trust placed in you reflects years of professional integrity and it opens significant doors.",
        "luckyNumbers": [
          23,
          37,
          68,
          85,
          98
        ],
        "luckyColor": "#228B22"
      },
      "Aquarius": {
        "date": "2026-02-02",
        "quote": "Humanity is better because you care about all of it.",
        "loveScore": 84,
        "workScore": 93,
        "healthScore": 73,
        "lovePrediction": "Your authentic self is your most magnetic quality and today it shines brilliantly, attracting genuine admiration from someone who sees exactly who you are.",
        "workPrediction": "Your forward-thinking contributions to a team project are the element that transforms good into exceptional. The future belongs to visionaries and today you demonstrate exactly why.",
        "luckyNumbers": [
          2,
          21,
          66,
          74,
          76
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-02",
        "quote": "You see the divine in every person you encounter.",
        "loveScore": 92,
        "workScore": 78,
        "healthScore": 73,
        "lovePrediction": "Soft, poetic love is your specialty and today you express it with particular grace. Your partner feels wrapped in something luminous — which is exactly what love looks like through your eyes.",
        "workPrediction": "Your imaginative approach to a practical problem delights everyone involved today. The unexpected beauty and functionality of your solution is vintage Pisces genius.",
        "luckyNumbers": [
          7,
          17,
          18,
          20,
          47
        ],
        "luckyColor": "#9C27B0"
      }
    }
  },
  {
    "date": "2026-02-03",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-03",
        "quote": "Bold actions today create the legacy of tomorrow.",
        "loveScore": 79,
        "workScore": 95,
        "healthScore": 81,
        "lovePrediction": "In existing relationships, passion surges and intimacy deepens when you lead with authentic expression. Plan something spontaneous and watch the magic unfold.",
        "workPrediction": "Your energy is infectious in the workplace today, motivating your team to match your ambitious pace. Recognition for your efforts arrives sooner than expected.",
        "luckyNumbers": [
          13,
          29,
          50,
          55,
          89
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-03",
        "quote": "Your loyalty is a rare and precious gift.",
        "loveScore": 83,
        "workScore": 86,
        "healthScore": 76,
        "lovePrediction": "Sensuality is heightened today and physical affection brings you and your partner closer than words ever could. Let yourself enjoy the pleasure of simple, loving connection without overthinking it.",
        "workPrediction": "A financial negotiation or salary-related conversation goes in your favor. Your research and preparation demonstrate your serious commitment to your professional worth.",
        "luckyNumbers": [
          25,
          34,
          55,
          66,
          80
        ],
        "luckyColor": "#228B22"
      },
      "Gemini": {
        "date": "2026-02-03",
        "quote": "The world is your classroom and you're the star student.",
        "loveScore": 87,
        "workScore": 71,
        "healthScore": 95,
        "lovePrediction": "Honesty in love creates the safety net that allows both of you to soar. Share something real today and receive the intimacy that only truth can create.",
        "workPrediction": "Your versatility shines today as you seamlessly move between very different types of tasks without losing effectiveness. This adaptability is a rare professional superpower.",
        "luckyNumbers": [
          17,
          29,
          36,
          39,
          61
        ],
        "luckyColor": "#40E0D0"
      },
      "Cancer": {
        "date": "2026-02-03",
        "quote": "Create spaces of warmth and watch happiness bloom.",
        "loveScore": 72,
        "workScore": 91,
        "healthScore": 92,
        "lovePrediction": "Your emotional intuition is tuned perfectly today, allowing you to sense what your loved one needs before they speak it. This profound attunement deepens your bond in ways words never could.",
        "workPrediction": "Creative projects benefit from your intuitive approach today. Trust the hunches that guide your professional choices — your instincts have an impressive track record.",
        "luckyNumbers": [
          4,
          10,
          15,
          75,
          92
        ],
        "luckyColor": "#E6E6FA"
      },
      "Leo": {
        "date": "2026-02-03",
        "quote": "Your creativity is a gift too beautiful to keep hidden.",
        "loveScore": 88,
        "workScore": 87,
        "healthScore": 94,
        "lovePrediction": "Your partner admires your confidence but craves your vulnerability too. Share your softer side today and watch your bond deepen to something truly magnificent.",
        "workPrediction": "Creative work receives outstanding recognition today. Your bold and original approach to a project stands out dramatically from the competition and earns well-deserved acclaim.",
        "luckyNumbers": [
          13,
          26,
          50,
          73,
          84
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-03",
        "quote": "Every system you build carries the hallmark of your genius.",
        "loveScore": 84,
        "workScore": 94,
        "healthScore": 79,
        "lovePrediction": "Your discerning heart recognizes quality when it sees it, and today you see it clearly. Trust your careful assessment of someone's character before investing your precious heart.",
        "workPrediction": "Helpful feedback you provide today creates a significant improvement in how your team operates. Your willingness to speak constructively is one of your most valuable professional gifts.",
        "luckyNumbers": [
          29,
          40,
          57,
          85,
          92
        ],
        "luckyColor": "#546E7A"
      },
      "Libra": {
        "date": "2026-02-03",
        "quote": "Peace is not passive — and your pursuit of it proves it.",
        "loveScore": 87,
        "workScore": 71,
        "healthScore": 75,
        "lovePrediction": "A decision about love becomes clearer today as your famous discernment cuts through confusion. Trust the verdict of your balanced heart — it always finds the fairest answer.",
        "workPrediction": "Your ability to present information fairly and persuasively makes today's professional meeting a success. Decision-makers trust your balanced assessment and act accordingly.",
        "luckyNumbers": [
          32,
          39,
          42,
          56,
          59
        ],
        "luckyColor": "#00BCD4"
      },
      "Scorpio": {
        "date": "2026-02-03",
        "quote": "Your transformation is the greatest story ever lived.",
        "loveScore": 87,
        "workScore": 83,
        "healthScore": 95,
        "lovePrediction": "Intense and transformative energy surges through your love life today. A soul-deep connection either deepens magnificently or a necessary truth finally surfaces. Either way, you grow.",
        "workPrediction": "A power dynamic at work shifts in your favor today. Your quiet observation and patient timing deliver the professional result you've been strategically positioning yourself for.",
        "luckyNumbers": [
          15,
          18,
          40,
          57,
          77
        ],
        "luckyColor": "#546E7A"
      },
      "Sagittarius": {
        "date": "2026-02-03",
        "quote": "The world opens up for those who remain curious.",
        "loveScore": 80,
        "workScore": 94,
        "healthScore": 90,
        "lovePrediction": "Freedom and love are not opposites in your world — you prove today that the most liberating thing is being fully yourself with someone who celebrates exactly that.",
        "workPrediction": "An international or cross-cultural professional opportunity excites your expansive mind today. Your comfort with diverse perspectives makes you the ideal candidate for this kind of work.",
        "luckyNumbers": [
          3,
          8,
          28,
          62,
          89
        ],
        "luckyColor": "#40E0D0"
      },
      "Capricorn": {
        "date": "2026-02-03",
        "quote": "Ambition without integrity is noise — yours is a symphony.",
        "loveScore": 79,
        "workScore": 88,
        "healthScore": 89,
        "lovePrediction": "Quality time over quantity is your love language today. A focused, device-free evening with your partner accomplishes more romantic progress than a month of rushed moments.",
        "workPrediction": "Your authority in your field is recognized today in a way that brings both professional and personal satisfaction. This validation confirms you are exactly where your effort was meant to take you.",
        "luckyNumbers": [
          25,
          31,
          35,
          45,
          82
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-03",
        "quote": "Your originality is the revolution the world has been waiting for.",
        "loveScore": 89,
        "workScore": 79,
        "healthScore": 81,
        "lovePrediction": "Your visionary heart seeks a partner who dreams as boldly as you do, and today you get a glimpse of that perfect alignment. Trust that the universe is guiding this one perfectly.",
        "workPrediction": "A technology or systems improvement you've been advocating for finally gets implemented today. Your persistence in championing better ways of working creates lasting positive impact.",
        "luckyNumbers": [
          55,
          56,
          58,
          88,
          89
        ],
        "luckyColor": "#0F52BA"
      },
      "Pisces": {
        "date": "2026-02-03",
        "quote": "Art and love flow through you like an endless river.",
        "loveScore": 85,
        "workScore": 94,
        "healthScore": 86,
        "lovePrediction": "Your romantic imagination creates a love story so beautiful today that reality is moved to match it. Trust the dreams your heart sends you — they are not fantasies but blueprints.",
        "workPrediction": "Your compassionate approach to a workplace challenge creates a solution that heals as well as it solves. This is the unique professional gift that sets you apart from everyone else.",
        "luckyNumbers": [
          11,
          13,
          41,
          92,
          99
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-04",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-04",
        "quote": "Fire within you burns brighter than any obstacle ahead.",
        "loveScore": 77,
        "workScore": 93,
        "healthScore": 95,
        "lovePrediction": "Romance is heating up in your world today. Your natural charisma creates electric chemistry with someone who matches your fire. Trust your instincts about who deserves your heart.",
        "workPrediction": "A negotiation or presentation goes powerfully in your favor. Your directness and preparation combine for a result that advances your career in meaningful ways.",
        "luckyNumbers": [
          7,
          12,
          49,
          51,
          78
        ],
        "luckyColor": "#FF9800"
      },
      "Taurus": {
        "date": "2026-02-04",
        "quote": "Ground yourself in gratitude and watch prosperity grow.",
        "loveScore": 72,
        "workScore": 80,
        "healthScore": 82,
        "lovePrediction": "An honest conversation about your needs and desires strengthens your partnership today. Vulnerability builds the kind of trust that makes love lasting and real.",
        "workPrediction": "Your methodical work style produces results that speak for themselves today. The quality and consistency of your output builds the professional reputation you deserve.",
        "luckyNumbers": [
          39,
          52,
          59,
          72,
          73
        ],
        "luckyColor": "#F48FB1"
      },
      "Gemini": {
        "date": "2026-02-04",
        "quote": "Ideas flow through you like a river of infinite possibility.",
        "loveScore": 95,
        "workScore": 85,
        "healthScore": 87,
        "lovePrediction": "Witty banter and intellectual chemistry spark something wonderful in your love life today. A stimulating conversation with a potential partner reveals surprising depths of compatibility. Keep talking.",
        "workPrediction": "Multitasking efficiency reaches an impressive peak today. You handle several complex tasks simultaneously without losing quality, demonstrating the versatility that makes you indispensable.",
        "luckyNumbers": [
          37,
          39,
          53,
          85,
          89
        ],
        "luckyColor": "#FFBF00"
      },
      "Cancer": {
        "date": "2026-02-04",
        "quote": "Trust the whisper of your heart — it always knows.",
        "loveScore": 86,
        "workScore": 89,
        "healthScore": 86,
        "lovePrediction": "Emotional conversations held today have the power to heal old wounds and create new levels of intimacy. Allow yourself to be both the one who comforts and the one who is comforted.",
        "workPrediction": "Your natural caregiving energy makes you an exceptional team member today. Colleagues feel supported and motivated, which reflects beautifully in the collective output.",
        "luckyNumbers": [
          5,
          10,
          35,
          61,
          95
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-04",
        "quote": "You don't just live life — you perform it magnificently.",
        "loveScore": 91,
        "workScore": 76,
        "healthScore": 83,
        "lovePrediction": "Romance is theatrical and thrilling today in the very best way. Lean into the drama of love — plan something memorable that shows your partner how much you cherish them.",
        "workPrediction": "Mentoring someone at work brings you the deepest professional satisfaction today. Your natural generosity of spirit creates an impact on this person that extends far beyond the workday.",
        "luckyNumbers": [
          10,
          67,
          75,
          90,
          97
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-04",
        "quote": "Cleanliness of thought leads to clarity of purpose.",
        "loveScore": 76,
        "workScore": 81,
        "healthScore": 82,
        "lovePrediction": "Romance is in the practical details today — a perfectly timed cup of tea, a remembered appointment, a worry addressed before it was spoken. These are your love letters.",
        "workPrediction": "Your systematic approach to a new challenge produces a plan so thorough that your superiors immediately trust you to implement it independently. Confidence well placed in you.",
        "luckyNumbers": [
          6,
          10,
          27,
          53,
          91
        ],
        "luckyColor": "#228B22"
      },
      "Libra": {
        "date": "2026-02-04",
        "quote": "Your social grace is a superpower used best for good.",
        "loveScore": 87,
        "workScore": 89,
        "healthScore": 87,
        "lovePrediction": "Harmony and romance dance together beautifully in your life today. Your natural grace creates an environment where love feels safe, beautiful, and deeply fulfilling.",
        "workPrediction": "A collaborative project thrives under your facilitative leadership today. Your ability to bring out the best in everyone around you creates results greater than any individual could achieve.",
        "luckyNumbers": [
          7,
          43,
          53,
          92,
          98
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-04",
        "quote": "Fearlessness and focus — your two greatest allies.",
        "loveScore": 73,
        "workScore": 85,
        "healthScore": 86,
        "lovePrediction": "Emotional honesty, though challenging for your privacy-loving soul, creates the kind of intimacy you crave most. Take the risk of being seen completely — it's worth it.",
        "workPrediction": "Your intensity and focus allow you to accomplish in one day what others would spread over a week. This level of concentrated effort does not go unnoticed by those who matter.",
        "luckyNumbers": [
          38,
          81,
          88,
          89,
          94
        ],
        "luckyColor": "#8B0000"
      },
      "Sagittarius": {
        "date": "2026-02-04",
        "quote": "Your boundless enthusiasm is your most inspiring quality.",
        "loveScore": 90,
        "workScore": 93,
        "healthScore": 84,
        "lovePrediction": "Your honesty, even when blunt, is the most attractive thing about you and someone in your world appreciates it profoundly today. Authenticity is your greatest romantic asset.",
        "workPrediction": "Educational or publishing opportunities in your professional sphere open up today. Your natural wisdom and communication skills position you perfectly to share what you know with a wider audience.",
        "luckyNumbers": [
          9,
          46,
          58,
          79,
          99
        ],
        "luckyColor": "#0F52BA"
      },
      "Capricorn": {
        "date": "2026-02-04",
        "quote": "Every mountain you climb makes you more worthy of the summit.",
        "loveScore": 89,
        "workScore": 71,
        "healthScore": 84,
        "lovePrediction": "Commitment feels like a reward rather than a burden in your relationship today. Reaffirm your dedication and watch your partner's eyes light up with the certainty of being chosen.",
        "workPrediction": "A mentor or senior professional takes meaningful interest in your career today. The guidance they offer is gold — receive it with the humility and gratitude it deserves.",
        "luckyNumbers": [
          29,
          38,
          48,
          58,
          76
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-04",
        "quote": "Think differently — the world needs your unique perspective.",
        "loveScore": 90,
        "workScore": 86,
        "healthScore": 83,
        "lovePrediction": "Intellectual attraction is the most powerful force in your romantic world today. A meeting of brilliant minds creates the kind of spark that doesn't easily fade.",
        "workPrediction": "Collaboration on a technology-forward or socially impactful project brings you both professional satisfaction and meaningful results. This is the kind of work your brilliant mind was made for.",
        "luckyNumbers": [
          16,
          19,
          49,
          66,
          75
        ],
        "luckyColor": "#0F52BA"
      },
      "Pisces": {
        "date": "2026-02-04",
        "quote": "Your sensitivity reads the world in ways others cannot.",
        "loveScore": 91,
        "workScore": 74,
        "healthScore": 92,
        "lovePrediction": "A spiritual or creative connection with someone new feels both familiar and thrillingly unknown. Your soul recognizes this meeting — trust the sacred feeling and follow its thread.",
        "workPrediction": "Imaginative work flourishes under your inspired guidance today. The solutions you generate feel almost magical to your more analytical colleagues, yet they are powerfully effective.",
        "luckyNumbers": [
          40,
          47,
          64,
          68,
          89
        ],
        "luckyColor": "#B8C4D8"
      }
    }
  },
  {
    "date": "2026-02-05",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-05",
        "quote": "Champions are made in moments others choose to give up.",
        "loveScore": 70,
        "workScore": 79,
        "healthScore": 73,
        "lovePrediction": "Passion and tenderness combine beautifully in your romantic life today. Express appreciation openly and watch your relationships flourish with warmth and renewed connection.",
        "workPrediction": "Leadership opportunities surface and you step into them naturally. Your colleagues benefit enormously from your decisive guidance and high energy today.",
        "luckyNumbers": [
          39,
          50,
          65,
          67,
          93
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-05",
        "quote": "Comfort and success are not mutually exclusive — you prove it.",
        "loveScore": 70,
        "workScore": 82,
        "healthScore": 72,
        "lovePrediction": "Slow and sensual energy surrounds your love life today. Take time to truly connect with your partner through touch, presence, and genuine appreciation. Quality time matters more than grand gestures right now.",
        "workPrediction": "Financial matters benefit from your careful and methodical review. A decision made with deliberation today protects and grows your resources beautifully.",
        "luckyNumbers": [
          21,
          36,
          38,
          39,
          88
        ],
        "luckyColor": "#F48FB1"
      },
      "Gemini": {
        "date": "2026-02-05",
        "quote": "Your words have the power to change minds and open hearts.",
        "loveScore": 95,
        "workScore": 73,
        "healthScore": 95,
        "lovePrediction": "Communication is your love language and today it flows beautifully. Express what you've been holding back and watch the space between you and your loved one dissolve.",
        "workPrediction": "Networking opens a significant professional door today. Your natural conversational gift creates connections that develop into valuable opportunities over the coming weeks.",
        "luckyNumbers": [
          22,
          23,
          29,
          59,
          87
        ],
        "luckyColor": "#FF7F50"
      },
      "Cancer": {
        "date": "2026-02-05",
        "quote": "Your sensitivity is not weakness; it is profound strength.",
        "loveScore": 86,
        "workScore": 71,
        "healthScore": 80,
        "lovePrediction": "Your intuition leads you toward a meaningful romantic connection today. Trust the subtle feelings guiding your heart — they are far more reliable than logic in matters of love.",
        "workPrediction": "A long-term professional project you've been carefully tending is ready to bloom. Your patience and dedication have created something truly worth being proud of.",
        "luckyNumbers": [
          36,
          37,
          71,
          85,
          94
        ],
        "luckyColor": "#40E0D0"
      },
      "Leo": {
        "date": "2026-02-05",
        "quote": "Let your roar be heard by those who need your strength.",
        "loveScore": 95,
        "workScore": 72,
        "healthScore": 85,
        "lovePrediction": "Creative expression and romance intertwine beautifully today. Write a poem, sing a song, or simply speak your heart — your words of love are more powerful than you know.",
        "workPrediction": "Your ambitious goals receive a boost of momentum today as a key obstacle clears unexpectedly. Continue pushing forward with confidence — your dedication is about to be rewarded.",
        "luckyNumbers": [
          12,
          13,
          40,
          45,
          86
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-05",
        "quote": "Your methodical nature builds what inspiration alone cannot.",
        "loveScore": 74,
        "workScore": 90,
        "healthScore": 90,
        "lovePrediction": "Your acts of service speak the love your lips sometimes struggle to express today. A small, thoughtful gesture shows your partner more than any grand speech ever could.",
        "workPrediction": "A complex analytical task plays perfectly into your exceptional abilities today. The thoroughness of your work earns genuine admiration from those who understand what it took.",
        "luckyNumbers": [
          14,
          49,
          52,
          73,
          80
        ],
        "luckyColor": "#0F52BA"
      },
      "Libra": {
        "date": "2026-02-05",
        "quote": "Where others see conflict you see an opportunity to harmonize.",
        "loveScore": 75,
        "workScore": 79,
        "healthScore": 86,
        "lovePrediction": "For Librans seeking love, your natural magnetism is amplified today. Dress beautifully, smile genuinely, and trust that the universe is arranging a meaningful connection just for you.",
        "workPrediction": "An important professional relationship strengthens today through your sincere investment in mutual understanding. This connection will pay dividends in ways you can't yet fully predict.",
        "luckyNumbers": [
          8,
          39,
          67,
          68,
          82
        ],
        "luckyColor": "#E6E6FA"
      },
      "Scorpio": {
        "date": "2026-02-05",
        "quote": "The deeper you go, the more power you bring back.",
        "loveScore": 90,
        "workScore": 70,
        "healthScore": 86,
        "lovePrediction": "Your perceptive nature sees beneath the surface of your romantic connections today, reading what isn't being said with impressive accuracy. Use this wisdom with gentleness.",
        "workPrediction": "Research-intensive work flourishes under your exacting attention today. Your thoroughness uncovers insights that fundamentally improve your project and demonstrate your exceptional value.",
        "luckyNumbers": [
          11,
          16,
          22,
          69,
          81
        ],
        "luckyColor": "#9C27B0"
      },
      "Sagittarius": {
        "date": "2026-02-05",
        "quote": "Adventure is not where you go — it's who you are.",
        "loveScore": 89,
        "workScore": 76,
        "healthScore": 70,
        "lovePrediction": "Your partner or romantic interest benefits from your uncanny ability to make them laugh and think at the same time. This combination of humor and depth is what makes you unforgettable.",
        "workPrediction": "Your optimism about a professional outcome proves well-founded as positive news arrives. Continue trusting your intuitive assessments — your gut reads the future accurately.",
        "luckyNumbers": [
          58,
          69,
          83,
          86,
          90
        ],
        "luckyColor": "#9C27B0"
      },
      "Capricorn": {
        "date": "2026-02-05",
        "quote": "Your persistence builds what talent alone cannot.",
        "loveScore": 78,
        "workScore": 88,
        "healthScore": 74,
        "lovePrediction": "Love built on mutual respect and shared ambition deepens beautifully today. Your partner admires your dedication and feels inspired by your quiet strength. Show your appreciation in return.",
        "workPrediction": "A leadership opportunity materializes that aligns perfectly with your long-term career strategy. Step into it with the confidence of someone who has been preparing for exactly this.",
        "luckyNumbers": [
          9,
          13,
          16,
          25,
          68
        ],
        "luckyColor": "#0F52BA"
      },
      "Aquarius": {
        "date": "2026-02-05",
        "quote": "You are the change you've been waiting to see.",
        "loveScore": 95,
        "workScore": 92,
        "healthScore": 74,
        "lovePrediction": "A humanitarian cause or shared interest brings you into close proximity with someone whose passion matches your own. This kind of attraction, rooted in shared purpose, is the most lasting.",
        "workPrediction": "Your unconventional approach is exactly what breaks a professional logjam that has frustrated everyone else. Original thinking is the rarest and most valuable professional commodity.",
        "luckyNumbers": [
          5,
          44,
          51,
          63,
          77
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-05",
        "quote": "The universe speaks to you in poetry and you listen.",
        "loveScore": 74,
        "workScore": 85,
        "healthScore": 93,
        "lovePrediction": "Love today feels like a dream you hope you never wake from. Your sensitivity allows you to experience romantic connection at a depth most people only read about in poetry.",
        "workPrediction": "A spiritual or philosophical dimension of your work deepens your professional purpose today. When your work aligns with your soul, the quality becomes transcendent.",
        "luckyNumbers": [
          31,
          38,
          54,
          58,
          66
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-06",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-06",
        "quote": "Your passion is the engine that drives extraordinary results.",
        "loveScore": 82,
        "workScore": 75,
        "healthScore": 76,
        "lovePrediction": "Sparks fly when you least expect them today. Your magnetic energy draws someone special closer, creating a connection that feels both exciting and refreshingly new. Allow yourself to be vulnerable — it's your strength, not your weakness.",
        "workPrediction": "A competitive situation plays beautifully into your strengths. Channel your natural drive into focused action and you'll secure the outcome you've been working toward.",
        "luckyNumbers": [
          6,
          41,
          57,
          64,
          78
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-06",
        "quote": "Your persistence carves paths through solid stone.",
        "loveScore": 84,
        "workScore": 83,
        "healthScore": 74,
        "lovePrediction": "A romantic gesture doesn't need to be elaborate to be meaningful. Cook a meal, write a note, or simply sit quietly together — your love language speaks through care.",
        "workPrediction": "Your reliability earns you a significant opportunity at work. Someone in a position of influence has been quietly observing your consistency and is ready to reward it.",
        "luckyNumbers": [
          31,
          57,
          70,
          71,
          97
        ],
        "luckyColor": "#C9A84C"
      },
      "Gemini": {
        "date": "2026-02-06",
        "quote": "Curiosity never killed the cat — it made you exceptional.",
        "loveScore": 81,
        "workScore": 94,
        "healthScore": 73,
        "lovePrediction": "Your social energy attracts fascinating people today, and one connection feels particularly charged with romantic potential. Follow the thread of curiosity to see where it leads.",
        "workPrediction": "A writing, speaking, or communication-based project receives outstanding feedback. Your natural gift for words creates professional results that exceed expectations nicely.",
        "luckyNumbers": [
          30,
          65,
          67,
          71,
          78
        ],
        "luckyColor": "#40E0D0"
      },
      "Cancer": {
        "date": "2026-02-06",
        "quote": "Every act of love you give returns to you threefold.",
        "loveScore": 80,
        "workScore": 82,
        "healthScore": 71,
        "lovePrediction": "A romantic daydream from this morning may very well be reality by evening. Your feelings are magnetic today and they draw matching energy toward you effortlessly.",
        "workPrediction": "Your memory for people's preferences and history makes you exceptionally effective at client relationships today. This personal touch generates professional loyalty that translates into real success.",
        "luckyNumbers": [
          16,
          46,
          51,
          63,
          87
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-06",
        "quote": "Generosity is the hallmark of true royalty, and you reign.",
        "loveScore": 85,
        "workScore": 74,
        "healthScore": 90,
        "lovePrediction": "Your radiance is impossible to ignore today and romance is sparked by your generous, sun-bright energy. Someone is captivated by the way you light up every room you enter.",
        "workPrediction": "Your generosity with credit and praise motivates your team to remarkable heights. True leaders lift others up, and today you do this beautifully and effectively.",
        "luckyNumbers": [
          2,
          12,
          17,
          23,
          25
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-06",
        "quote": "You see the flaw not to condemn but to create perfection.",
        "loveScore": 77,
        "workScore": 82,
        "healthScore": 76,
        "lovePrediction": "A quiet evening of meaningful conversation reveals new layers in your relationship that thrill and deepen your connection. Your attention to detail makes your partner feel truly seen.",
        "workPrediction": "Your organizational skills bring order to a chaotic situation at work today, making the impossible feel manageable and earning you deep appreciation from your team.",
        "luckyNumbers": [
          27,
          31,
          42,
          54,
          61
        ],
        "luckyColor": "#546E7A"
      },
      "Libra": {
        "date": "2026-02-06",
        "quote": "Your love of fairness makes you a champion for all.",
        "loveScore": 83,
        "workScore": 91,
        "healthScore": 75,
        "lovePrediction": "Balance in giving and receiving love creates the perfect romantic rhythm today. Allow yourself to receive as graciously as you give — your partner loves to cherish you too.",
        "workPrediction": "Partnership opportunities in your career sector open up today. Your collaborative nature and professional reputation attract exactly the kind of partner who will amplify your success.",
        "luckyNumbers": [
          42,
          56,
          63,
          94,
          97
        ],
        "luckyColor": "#E6E6FA"
      },
      "Scorpio": {
        "date": "2026-02-06",
        "quote": "You are the storm and the calm that follows.",
        "loveScore": 78,
        "workScore": 92,
        "healthScore": 74,
        "lovePrediction": "Your seductive energy is operating at full power today, drawing the right kind of attention from the right kind of people. Be intentional about where you direct this magnetic force.",
        "workPrediction": "A career transformation begins in earnest today as you take the first concrete step toward the professional life you've been envisioning. Your determination will carry you all the way.",
        "luckyNumbers": [
          24,
          26,
          38,
          41,
          81
        ],
        "luckyColor": "#546E7A"
      },
      "Sagittarius": {
        "date": "2026-02-06",
        "quote": "Your optimism is a contagion the world desperately needs.",
        "loveScore": 85,
        "workScore": 78,
        "healthScore": 81,
        "lovePrediction": "Love feels like the greatest adventure today and you embrace it with your signature enthusiasm. A new romantic possibility excites both your heart and your wanderlust.",
        "workPrediction": "Your ability to see the big picture saves a project that got lost in the details today. Your strategic perspective realigns the team and restores momentum impressively.",
        "luckyNumbers": [
          22,
          36,
          65,
          90,
          98
        ],
        "luckyColor": "#4B0082"
      },
      "Capricorn": {
        "date": "2026-02-06",
        "quote": "Structure is not limitation — it is the blueprint of greatness.",
        "loveScore": 81,
        "workScore": 91,
        "healthScore": 75,
        "lovePrediction": "Vulnerability in love does not compromise your strength; it elevates it. Sharing your deeper feelings with a trusted partner today creates a bond that will last decades.",
        "workPrediction": "Your reputation for reliability brings an important new responsibility your way today. The trust placed in you reflects years of professional integrity and it opens significant doors.",
        "luckyNumbers": [
          5,
          24,
          31,
          63,
          65
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-06",
        "quote": "Rebellion with purpose is the highest form of wisdom.",
        "loveScore": 81,
        "workScore": 92,
        "healthScore": 86,
        "lovePrediction": "Your authentic self is your most magnetic quality and today it shines brilliantly, attracting genuine admiration from someone who sees exactly who you are.",
        "workPrediction": "Your forward-thinking contributions to a team project are the element that transforms good into exceptional. The future belongs to visionaries and today you demonstrate exactly why.",
        "luckyNumbers": [
          1,
          38,
          39,
          44,
          57
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-06",
        "quote": "Your spiritual depth is a gift to all who know you.",
        "loveScore": 82,
        "workScore": 86,
        "healthScore": 86,
        "lovePrediction": "Soft, poetic love is your specialty and today you express it with particular grace. Your partner feels wrapped in something luminous — which is exactly what love looks like through your eyes.",
        "workPrediction": "Your imaginative approach to a practical problem delights everyone involved today. The unexpected beauty and functionality of your solution is vintage Pisces genius.",
        "luckyNumbers": [
          12,
          49,
          55,
          84,
          85
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-07",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-07",
        "quote": "Lead with confidence and the world will follow your path.",
        "loveScore": 90,
        "workScore": 78,
        "healthScore": 86,
        "lovePrediction": "In existing relationships, passion surges and intimacy deepens when you lead with authentic expression. Plan something spontaneous and watch the magic unfold.",
        "workPrediction": "Your energy is infectious in the workplace today, motivating your team to match your ambitious pace. Recognition for your efforts arrives sooner than expected.",
        "luckyNumbers": [
          7,
          15,
          22,
          64,
          94
        ],
        "luckyColor": "#FF9800"
      },
      "Taurus": {
        "date": "2026-02-07",
        "quote": "The best things in life are worth every moment of waiting.",
        "loveScore": 85,
        "workScore": 86,
        "healthScore": 73,
        "lovePrediction": "Sensuality is heightened today and physical affection brings you and your partner closer than words ever could. Let yourself enjoy the pleasure of simple, loving connection without overthinking it.",
        "workPrediction": "A financial negotiation or salary-related conversation goes in your favor. Your research and preparation demonstrate your serious commitment to your professional worth.",
        "luckyNumbers": [
          16,
          30,
          54,
          87,
          94
        ],
        "luckyColor": "#546E7A"
      },
      "Gemini": {
        "date": "2026-02-07",
        "quote": "Every moment holds a new idea waiting to be discovered.",
        "loveScore": 73,
        "workScore": 80,
        "healthScore": 93,
        "lovePrediction": "Honesty in love creates the safety net that allows both of you to soar. Share something real today and receive the intimacy that only truth can create.",
        "workPrediction": "Your versatility shines today as you seamlessly move between very different types of tasks without losing effectiveness. This adaptability is a rare professional superpower.",
        "luckyNumbers": [
          5,
          6,
          18,
          20,
          98
        ],
        "luckyColor": "#FFBF00"
      },
      "Cancer": {
        "date": "2026-02-07",
        "quote": "You carry the moon's wisdom in every choice you make.",
        "loveScore": 74,
        "workScore": 72,
        "healthScore": 85,
        "lovePrediction": "Your emotional intuition is tuned perfectly today, allowing you to sense what your loved one needs before they speak it. This profound attunement deepens your bond in ways words never could.",
        "workPrediction": "Creative projects benefit from your intuitive approach today. Trust the hunches that guide your professional choices — your instincts have an impressive track record.",
        "luckyNumbers": [
          21,
          26,
          45,
          46,
          51
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-07",
        "quote": "The world is better because you choose to shine in it.",
        "loveScore": 86,
        "workScore": 89,
        "healthScore": 91,
        "lovePrediction": "Your partner admires your confidence but craves your vulnerability too. Share your softer side today and watch your bond deepen to something truly magnificent.",
        "workPrediction": "Creative work receives outstanding recognition today. Your bold and original approach to a project stands out dramatically from the competition and earns well-deserved acclaim.",
        "luckyNumbers": [
          27,
          33,
          59,
          93,
          96
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-07",
        "quote": "Integrity and intelligence — your two greatest weapons.",
        "loveScore": 83,
        "workScore": 76,
        "healthScore": 81,
        "lovePrediction": "Your discerning heart recognizes quality when it sees it, and today you see it clearly. Trust your careful assessment of someone's character before investing your precious heart.",
        "workPrediction": "Helpful feedback you provide today creates a significant improvement in how your team operates. Your willingness to speak constructively is one of your most valuable professional gifts.",
        "luckyNumbers": [
          13,
          44,
          51,
          59,
          90
        ],
        "luckyColor": "#B8C4D8"
      },
      "Libra": {
        "date": "2026-02-07",
        "quote": "The scales of your wisdom always tip toward wisdom.",
        "loveScore": 72,
        "workScore": 88,
        "healthScore": 81,
        "lovePrediction": "A decision about love becomes clearer today as your famous discernment cuts through confusion. Trust the verdict of your balanced heart — it always finds the fairest answer.",
        "workPrediction": "Your ability to present information fairly and persuasively makes today's professional meeting a success. Decision-makers trust your balanced assessment and act accordingly.",
        "luckyNumbers": [
          8,
          26,
          37,
          57,
          70
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-07",
        "quote": "Your intensity of spirit is your most attractive quality.",
        "loveScore": 77,
        "workScore": 70,
        "healthScore": 94,
        "lovePrediction": "Intense and transformative energy surges through your love life today. A soul-deep connection either deepens magnificently or a necessary truth finally surfaces. Either way, you grow.",
        "workPrediction": "A power dynamic at work shifts in your favor today. Your quiet observation and patient timing deliver the professional result you've been strategically positioning yourself for.",
        "luckyNumbers": [
          72,
          78,
          84,
          87,
          91
        ],
        "luckyColor": "#800000"
      },
      "Sagittarius": {
        "date": "2026-02-07",
        "quote": "Truth-seeking is your highest calling and greatest gift.",
        "loveScore": 93,
        "workScore": 83,
        "healthScore": 72,
        "lovePrediction": "Freedom and love are not opposites in your world — you prove today that the most liberating thing is being fully yourself with someone who celebrates exactly that.",
        "workPrediction": "An international or cross-cultural professional opportunity excites your expansive mind today. Your comfort with diverse perspectives makes you the ideal candidate for this kind of work.",
        "luckyNumbers": [
          5,
          51,
          77,
          95,
          97
        ],
        "luckyColor": "#E040FB"
      },
      "Capricorn": {
        "date": "2026-02-07",
        "quote": "You don't just set goals; you engineer your destiny.",
        "loveScore": 94,
        "workScore": 86,
        "healthScore": 79,
        "lovePrediction": "Quality time over quantity is your love language today. A focused, device-free evening with your partner accomplishes more romantic progress than a month of rushed moments.",
        "workPrediction": "Your authority in your field is recognized today in a way that brings both professional and personal satisfaction. This validation confirms you are exactly where your effort was meant to take you.",
        "luckyNumbers": [
          24,
          28,
          33,
          53,
          93
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-07",
        "quote": "Your ideas don't just spark conversations — they start movements.",
        "loveScore": 81,
        "workScore": 80,
        "healthScore": 73,
        "lovePrediction": "Your visionary heart seeks a partner who dreams as boldly as you do, and today you get a glimpse of that perfect alignment. Trust that the universe is guiding this one perfectly.",
        "workPrediction": "A technology or systems improvement you've been advocating for finally gets implemented today. Your persistence in championing better ways of working creates lasting positive impact.",
        "luckyNumbers": [
          5,
          16,
          58,
          73,
          92
        ],
        "luckyColor": "#9C27B0"
      },
      "Pisces": {
        "date": "2026-02-07",
        "quote": "Healing comes naturally to those with hearts like yours.",
        "loveScore": 85,
        "workScore": 78,
        "healthScore": 93,
        "lovePrediction": "Your romantic imagination creates a love story so beautiful today that reality is moved to match it. Trust the dreams your heart sends you — they are not fantasies but blueprints.",
        "workPrediction": "Your compassionate approach to a workplace challenge creates a solution that heals as well as it solves. This is the unique professional gift that sets you apart from everyone else.",
        "luckyNumbers": [
          27,
          57,
          77,
          90,
          95
        ],
        "luckyColor": "#9C27B0"
      }
    }
  },
  {
    "date": "2026-02-08",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-08",
        "quote": "Every challenge you face sharpens the warrior within.",
        "loveScore": 89,
        "workScore": 72,
        "healthScore": 85,
        "lovePrediction": "Romance is heating up in your world today. Your natural charisma creates electric chemistry with someone who matches your fire. Trust your instincts about who deserves your heart.",
        "workPrediction": "A negotiation or presentation goes powerfully in your favor. Your directness and preparation combine for a result that advances your career in meaningful ways.",
        "luckyNumbers": [
          7,
          42,
          45,
          58,
          88
        ],
        "luckyColor": "#8B0000"
      },
      "Taurus": {
        "date": "2026-02-08",
        "quote": "You build empires one careful brick at a time.",
        "loveScore": 87,
        "workScore": 75,
        "healthScore": 92,
        "lovePrediction": "An honest conversation about your needs and desires strengthens your partnership today. Vulnerability builds the kind of trust that makes love lasting and real.",
        "workPrediction": "Your methodical work style produces results that speak for themselves today. The quality and consistency of your output builds the professional reputation you deserve.",
        "luckyNumbers": [
          16,
          56,
          69,
          74,
          83
        ],
        "luckyColor": "#50C878"
      },
      "Gemini": {
        "date": "2026-02-08",
        "quote": "Your mind is a garden where brilliant flowers bloom daily.",
        "loveScore": 89,
        "workScore": 86,
        "healthScore": 80,
        "lovePrediction": "Witty banter and intellectual chemistry spark something wonderful in your love life today. A stimulating conversation with a potential partner reveals surprising depths of compatibility. Keep talking.",
        "workPrediction": "Multitasking efficiency reaches an impressive peak today. You handle several complex tasks simultaneously without losing quality, demonstrating the versatility that makes you indispensable.",
        "luckyNumbers": [
          44,
          45,
          76,
          83,
          88
        ],
        "luckyColor": "#FF9800"
      },
      "Cancer": {
        "date": "2026-02-08",
        "quote": "Healing begins in the safe harbor of your presence.",
        "loveScore": 79,
        "workScore": 93,
        "healthScore": 80,
        "lovePrediction": "Emotional conversations held today have the power to heal old wounds and create new levels of intimacy. Allow yourself to be both the one who comforts and the one who is comforted.",
        "workPrediction": "Your natural caregiving energy makes you an exceptional team member today. Colleagues feel supported and motivated, which reflects beautifully in the collective output.",
        "luckyNumbers": [
          11,
          53,
          74,
          81,
          89
        ],
        "luckyColor": "#00BCD4"
      },
      "Leo": {
        "date": "2026-02-08",
        "quote": "Your pride in yourself inspires pride in everyone around you.",
        "loveScore": 85,
        "workScore": 88,
        "healthScore": 85,
        "lovePrediction": "Romance is theatrical and thrilling today in the very best way. Lean into the drama of love — plan something memorable that shows your partner how much you cherish them.",
        "workPrediction": "Mentoring someone at work brings you the deepest professional satisfaction today. Your natural generosity of spirit creates an impact on this person that extends far beyond the workday.",
        "luckyNumbers": [
          14,
          24,
          26,
          64,
          78
        ],
        "luckyColor": "#FF9800"
      },
      "Virgo": {
        "date": "2026-02-08",
        "quote": "The best plans in the room always begin with your mind.",
        "loveScore": 89,
        "workScore": 80,
        "healthScore": 74,
        "lovePrediction": "Romance is in the practical details today — a perfectly timed cup of tea, a remembered appointment, a worry addressed before it was spoken. These are your love letters.",
        "workPrediction": "Your systematic approach to a new challenge produces a plan so thorough that your superiors immediately trust you to implement it independently. Confidence well placed in you.",
        "luckyNumbers": [
          20,
          35,
          44,
          59,
          68
        ],
        "luckyColor": "#00695C"
      },
      "Libra": {
        "date": "2026-02-08",
        "quote": "You make collaboration feel effortless and natural.",
        "loveScore": 73,
        "workScore": 80,
        "healthScore": 76,
        "lovePrediction": "Harmony and romance dance together beautifully in your life today. Your natural grace creates an environment where love feels safe, beautiful, and deeply fulfilling.",
        "workPrediction": "A collaborative project thrives under your facilitative leadership today. Your ability to bring out the best in everyone around you creates results greater than any individual could achieve.",
        "luckyNumbers": [
          3,
          33,
          42,
          55,
          79
        ],
        "luckyColor": "#00BCD4"
      },
      "Scorpio": {
        "date": "2026-02-08",
        "quote": "Your depth reveals truths the surface never shows.",
        "loveScore": 73,
        "workScore": 95,
        "healthScore": 86,
        "lovePrediction": "Emotional honesty, though challenging for your privacy-loving soul, creates the kind of intimacy you crave most. Take the risk of being seen completely — it's worth it.",
        "workPrediction": "Your intensity and focus allow you to accomplish in one day what others would spread over a week. This level of concentrated effort does not go unnoticed by those who matter.",
        "luckyNumbers": [
          7,
          12,
          36,
          66,
          75
        ],
        "luckyColor": "#0F52BA"
      },
      "Sagittarius": {
        "date": "2026-02-08",
        "quote": "Expand your horizons and watch your world grow magnificent.",
        "loveScore": 88,
        "workScore": 83,
        "healthScore": 79,
        "lovePrediction": "Your honesty, even when blunt, is the most attractive thing about you and someone in your world appreciates it profoundly today. Authenticity is your greatest romantic asset.",
        "workPrediction": "Educational or publishing opportunities in your professional sphere open up today. Your natural wisdom and communication skills position you perfectly to share what you know with a wider audience.",
        "luckyNumbers": [
          7,
          23,
          24,
          92,
          96
        ],
        "luckyColor": "#9C27B0"
      },
      "Capricorn": {
        "date": "2026-02-08",
        "quote": "Hard work is your love language and success your response.",
        "loveScore": 71,
        "workScore": 87,
        "healthScore": 72,
        "lovePrediction": "Commitment feels like a reward rather than a burden in your relationship today. Reaffirm your dedication and watch your partner's eyes light up with the certainty of being chosen.",
        "workPrediction": "A mentor or senior professional takes meaningful interest in your career today. The guidance they offer is gold — receive it with the humility and gratitude it deserves.",
        "luckyNumbers": [
          30,
          32,
          39,
          49,
          86
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-08",
        "quote": "Technology and humanity are your twin passions and purpose.",
        "loveScore": 73,
        "workScore": 73,
        "healthScore": 86,
        "lovePrediction": "Intellectual attraction is the most powerful force in your romantic world today. A meeting of brilliant minds creates the kind of spark that doesn't easily fade.",
        "workPrediction": "Collaboration on a technology-forward or socially impactful project brings you both professional satisfaction and meaningful results. This is the kind of work your brilliant mind was made for.",
        "luckyNumbers": [
          13,
          22,
          31,
          45,
          55
        ],
        "luckyColor": "#40E0D0"
      },
      "Pisces": {
        "date": "2026-02-08",
        "quote": "You swim in currents of emotion and emerge with wisdom.",
        "loveScore": 77,
        "workScore": 72,
        "healthScore": 86,
        "lovePrediction": "A spiritual or creative connection with someone new feels both familiar and thrillingly unknown. Your soul recognizes this meeting — trust the sacred feeling and follow its thread.",
        "workPrediction": "Imaginative work flourishes under your inspired guidance today. The solutions you generate feel almost magical to your more analytical colleagues, yet they are powerfully effective.",
        "luckyNumbers": [
          4,
          34,
          35,
          93,
          96
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-09",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-09",
        "quote": "Dare to begin and half the battle is already won.",
        "loveScore": 75,
        "workScore": 88,
        "healthScore": 81,
        "lovePrediction": "Passion and tenderness combine beautifully in your romantic life today. Express appreciation openly and watch your relationships flourish with warmth and renewed connection.",
        "workPrediction": "Leadership opportunities surface and you step into them naturally. Your colleagues benefit enormously from your decisive guidance and high energy today.",
        "luckyNumbers": [
          6,
          7,
          72,
          90,
          98
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-09",
        "quote": "Stability is not limitation — it is your greatest strength.",
        "loveScore": 78,
        "workScore": 93,
        "healthScore": 91,
        "lovePrediction": "Slow and sensual energy surrounds your love life today. Take time to truly connect with your partner through touch, presence, and genuine appreciation. Quality time matters more than grand gestures right now.",
        "workPrediction": "Financial matters benefit from your careful and methodical review. A decision made with deliberation today protects and grows your resources beautifully.",
        "luckyNumbers": [
          21,
          23,
          59,
          61,
          84
        ],
        "luckyColor": "#228B22"
      },
      "Gemini": {
        "date": "2026-02-09",
        "quote": "Speak your truth and watch the right doors swing open.",
        "loveScore": 73,
        "workScore": 83,
        "healthScore": 81,
        "lovePrediction": "Communication is your love language and today it flows beautifully. Express what you've been holding back and watch the space between you and your loved one dissolve.",
        "workPrediction": "Networking opens a significant professional door today. Your natural conversational gift creates connections that develop into valuable opportunities over the coming weeks.",
        "luckyNumbers": [
          17,
          47,
          53,
          60,
          81
        ],
        "luckyColor": "#00BCD4"
      },
      "Cancer": {
        "date": "2026-02-09",
        "quote": "Your compassion is a lighthouse for those lost at sea.",
        "loveScore": 78,
        "workScore": 90,
        "healthScore": 95,
        "lovePrediction": "Your intuition leads you toward a meaningful romantic connection today. Trust the subtle feelings guiding your heart — they are far more reliable than logic in matters of love.",
        "workPrediction": "A long-term professional project you've been carefully tending is ready to bloom. Your patience and dedication have created something truly worth being proud of.",
        "luckyNumbers": [
          16,
          25,
          27,
          42,
          75
        ],
        "luckyColor": "#00BCD4"
      },
      "Leo": {
        "date": "2026-02-09",
        "quote": "Drama is your art; love is your masterpiece.",
        "loveScore": 93,
        "workScore": 75,
        "healthScore": 81,
        "lovePrediction": "Creative expression and romance intertwine beautifully today. Write a poem, sing a song, or simply speak your heart — your words of love are more powerful than you know.",
        "workPrediction": "Your ambitious goals receive a boost of momentum today as a key obstacle clears unexpectedly. Continue pushing forward with confidence — your dedication is about to be rewarded.",
        "luckyNumbers": [
          23,
          58,
          65,
          76,
          80
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-09",
        "quote": "Your dedication to craft is an inspiration to all who watch.",
        "loveScore": 82,
        "workScore": 71,
        "healthScore": 88,
        "lovePrediction": "Your acts of service speak the love your lips sometimes struggle to express today. A small, thoughtful gesture shows your partner more than any grand speech ever could.",
        "workPrediction": "A complex analytical task plays perfectly into your exceptional abilities today. The thoroughness of your work earns genuine admiration from those who understand what it took.",
        "luckyNumbers": [
          14,
          26,
          31,
          58,
          90
        ],
        "luckyColor": "#228B22"
      },
      "Libra": {
        "date": "2026-02-09",
        "quote": "Elegance is your language; fairness is your message.",
        "loveScore": 93,
        "workScore": 81,
        "healthScore": 82,
        "lovePrediction": "For Librans seeking love, your natural magnetism is amplified today. Dress beautifully, smile genuinely, and trust that the universe is arranging a meaningful connection just for you.",
        "workPrediction": "An important professional relationship strengthens today through your sincere investment in mutual understanding. This connection will pay dividends in ways you can't yet fully predict.",
        "luckyNumbers": [
          1,
          41,
          50,
          52,
          70
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-09",
        "quote": "Transformation is your superpower — use it fearlessly.",
        "loveScore": 84,
        "workScore": 81,
        "healthScore": 92,
        "lovePrediction": "Your perceptive nature sees beneath the surface of your romantic connections today, reading what isn't being said with impressive accuracy. Use this wisdom with gentleness.",
        "workPrediction": "Research-intensive work flourishes under your exacting attention today. Your thoroughness uncovers insights that fundamentally improve your project and demonstrate your exceptional value.",
        "luckyNumbers": [
          25,
          45,
          76,
          95,
          98
        ],
        "luckyColor": "#DC143C"
      },
      "Sagittarius": {
        "date": "2026-02-09",
        "quote": "The arrow of your intention always finds its mark.",
        "loveScore": 73,
        "workScore": 71,
        "healthScore": 80,
        "lovePrediction": "Your partner or romantic interest benefits from your uncanny ability to make them laugh and think at the same time. This combination of humor and depth is what makes you unforgettable.",
        "workPrediction": "Your optimism about a professional outcome proves well-founded as positive news arrives. Continue trusting your intuitive assessments — your gut reads the future accurately.",
        "luckyNumbers": [
          24,
          44,
          50,
          63,
          80
        ],
        "luckyColor": "#00BCD4"
      },
      "Capricorn": {
        "date": "2026-02-09",
        "quote": "Your reliability is the foundation others build their lives on.",
        "loveScore": 88,
        "workScore": 78,
        "healthScore": 92,
        "lovePrediction": "Love built on mutual respect and shared ambition deepens beautifully today. Your partner admires your dedication and feels inspired by your quiet strength. Show your appreciation in return.",
        "workPrediction": "A leadership opportunity materializes that aligns perfectly with your long-term career strategy. Step into it with the confidence of someone who has been preparing for exactly this.",
        "luckyNumbers": [
          36,
          56,
          57,
          62,
          84
        ],
        "luckyColor": "#228B22"
      },
      "Aquarius": {
        "date": "2026-02-09",
        "quote": "The future belongs to those who imagine it differently.",
        "loveScore": 75,
        "workScore": 85,
        "healthScore": 79,
        "lovePrediction": "A humanitarian cause or shared interest brings you into close proximity with someone whose passion matches your own. This kind of attraction, rooted in shared purpose, is the most lasting.",
        "workPrediction": "Your unconventional approach is exactly what breaks a professional logjam that has frustrated everyone else. Original thinking is the rarest and most valuable professional commodity.",
        "luckyNumbers": [
          24,
          44,
          74,
          90,
          92
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-09",
        "quote": "Dreaming and doing are not opposites in your world.",
        "loveScore": 73,
        "workScore": 87,
        "healthScore": 73,
        "lovePrediction": "Love today feels like a dream you hope you never wake from. Your sensitivity allows you to experience romantic connection at a depth most people only read about in poetry.",
        "workPrediction": "A spiritual or philosophical dimension of your work deepens your professional purpose today. When your work aligns with your soul, the quality becomes transcendent.",
        "luckyNumbers": [
          17,
          50,
          58,
          60,
          89
        ],
        "luckyColor": "#9C27B0"
      }
    }
  },
  {
    "date": "2026-02-10",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-10",
        "quote": "Your strength comes from every storm you've weathered.",
        "loveScore": 85,
        "workScore": 84,
        "healthScore": 94,
        "lovePrediction": "Sparks fly when you least expect them today. Your magnetic energy draws someone special closer, creating a connection that feels both exciting and refreshingly new. Allow yourself to be vulnerable — it's your strength, not your weakness.",
        "workPrediction": "A competitive situation plays beautifully into your strengths. Channel your natural drive into focused action and you'll secure the outcome you've been working toward.",
        "luckyNumbers": [
          35,
          36,
          59,
          81,
          88
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-10",
        "quote": "Trust the slow growth; the strongest trees take time.",
        "loveScore": 85,
        "workScore": 80,
        "healthScore": 78,
        "lovePrediction": "A romantic gesture doesn't need to be elaborate to be meaningful. Cook a meal, write a note, or simply sit quietly together — your love language speaks through care.",
        "workPrediction": "Your reliability earns you a significant opportunity at work. Someone in a position of influence has been quietly observing your consistency and is ready to reward it.",
        "luckyNumbers": [
          3,
          41,
          80,
          90,
          95
        ],
        "luckyColor": "#228B22"
      },
      "Gemini": {
        "date": "2026-02-10",
        "quote": "Flexibility and intelligence make you absolutely unstoppable.",
        "loveScore": 88,
        "workScore": 81,
        "healthScore": 93,
        "lovePrediction": "Your social energy attracts fascinating people today, and one connection feels particularly charged with romantic potential. Follow the thread of curiosity to see where it leads.",
        "workPrediction": "A writing, speaking, or communication-based project receives outstanding feedback. Your natural gift for words creates professional results that exceed expectations nicely.",
        "luckyNumbers": [
          8,
          24,
          32,
          38,
          62
        ],
        "luckyColor": "#40E0D0"
      },
      "Cancer": {
        "date": "2026-02-10",
        "quote": "The ones you love are forever enriched by your care.",
        "loveScore": 82,
        "workScore": 82,
        "healthScore": 88,
        "lovePrediction": "A romantic daydream from this morning may very well be reality by evening. Your feelings are magnetic today and they draw matching energy toward you effortlessly.",
        "workPrediction": "Your memory for people's preferences and history makes you exceptionally effective at client relationships today. This personal touch generates professional loyalty that translates into real success.",
        "luckyNumbers": [
          64,
          72,
          74,
          86,
          96
        ],
        "luckyColor": "#E6E6FA"
      },
      "Leo": {
        "date": "2026-02-10",
        "quote": "You are the warmth that makes cold days worth enduring.",
        "loveScore": 72,
        "workScore": 95,
        "healthScore": 72,
        "lovePrediction": "Your radiance is impossible to ignore today and romance is sparked by your generous, sun-bright energy. Someone is captivated by the way you light up every room you enter.",
        "workPrediction": "Your generosity with credit and praise motivates your team to remarkable heights. True leaders lift others up, and today you do this beautifully and effectively.",
        "luckyNumbers": [
          5,
          53,
          59,
          71,
          98
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-10",
        "quote": "Precision is your poetry; organization is your art.",
        "loveScore": 79,
        "workScore": 83,
        "healthScore": 72,
        "lovePrediction": "A quiet evening of meaningful conversation reveals new layers in your relationship that thrill and deepen your connection. Your attention to detail makes your partner feel truly seen.",
        "workPrediction": "Your organizational skills bring order to a chaotic situation at work today, making the impossible feel manageable and earning you deep appreciation from your team.",
        "luckyNumbers": [
          3,
          64,
          92,
          94,
          98
        ],
        "luckyColor": "#546E7A"
      },
      "Libra": {
        "date": "2026-02-10",
        "quote": "Your presence creates calm in the most turbulent rooms.",
        "loveScore": 71,
        "workScore": 94,
        "healthScore": 85,
        "lovePrediction": "Balance in giving and receiving love creates the perfect romantic rhythm today. Allow yourself to receive as graciously as you give — your partner loves to cherish you too.",
        "workPrediction": "Partnership opportunities in your career sector open up today. Your collaborative nature and professional reputation attract exactly the kind of partner who will amplify your success.",
        "luckyNumbers": [
          10,
          29,
          44,
          58,
          70
        ],
        "luckyColor": "#00BCD4"
      },
      "Scorpio": {
        "date": "2026-02-10",
        "quote": "Intensity and purpose together make you unstoppable.",
        "loveScore": 89,
        "workScore": 93,
        "healthScore": 73,
        "lovePrediction": "Your seductive energy is operating at full power today, drawing the right kind of attention from the right kind of people. Be intentional about where you direct this magnetic force.",
        "workPrediction": "A career transformation begins in earnest today as you take the first concrete step toward the professional life you've been envisioning. Your determination will carry you all the way.",
        "luckyNumbers": [
          25,
          66,
          77,
          78,
          92
        ],
        "luckyColor": "#546E7A"
      },
      "Sagittarius": {
        "date": "2026-02-10",
        "quote": "Freedom is not your goal; it's your birthright.",
        "loveScore": 95,
        "workScore": 83,
        "healthScore": 79,
        "lovePrediction": "Love feels like the greatest adventure today and you embrace it with your signature enthusiasm. A new romantic possibility excites both your heart and your wanderlust.",
        "workPrediction": "Your ability to see the big picture saves a project that got lost in the details today. Your strategic perspective realigns the team and restores momentum impressively.",
        "luckyNumbers": [
          4,
          18,
          23,
          80,
          88
        ],
        "luckyColor": "#40E0D0"
      },
      "Capricorn": {
        "date": "2026-02-10",
        "quote": "Legacy is built one disciplined day at a time.",
        "loveScore": 76,
        "workScore": 74,
        "healthScore": 91,
        "lovePrediction": "Vulnerability in love does not compromise your strength; it elevates it. Sharing your deeper feelings with a trusted partner today creates a bond that will last decades.",
        "workPrediction": "Your reputation for reliability brings an important new responsibility your way today. The trust placed in you reflects years of professional integrity and it opens significant doors.",
        "luckyNumbers": [
          31,
          82,
          91,
          95,
          99
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-10",
        "quote": "Your independence is your greatest act of self-love.",
        "loveScore": 77,
        "workScore": 93,
        "healthScore": 86,
        "lovePrediction": "Your authentic self is your most magnetic quality and today it shines brilliantly, attracting genuine admiration from someone who sees exactly who you are.",
        "workPrediction": "Your forward-thinking contributions to a team project are the element that transforms good into exceptional. The future belongs to visionaries and today you demonstrate exactly why.",
        "luckyNumbers": [
          3,
          16,
          42,
          87,
          98
        ],
        "luckyColor": "#0F52BA"
      },
      "Pisces": {
        "date": "2026-02-10",
        "quote": "Your kindness ripples outward into infinity.",
        "loveScore": 71,
        "workScore": 80,
        "healthScore": 71,
        "lovePrediction": "Soft, poetic love is your specialty and today you express it with particular grace. Your partner feels wrapped in something luminous — which is exactly what love looks like through your eyes.",
        "workPrediction": "Your imaginative approach to a practical problem delights everyone involved today. The unexpected beauty and functionality of your solution is vintage Pisces genius.",
        "luckyNumbers": [
          21,
          38,
          41,
          45,
          83
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-11",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-11",
        "quote": "Ignite the world with the fire only you can start.",
        "loveScore": 73,
        "workScore": 88,
        "healthScore": 76,
        "lovePrediction": "In existing relationships, passion surges and intimacy deepens when you lead with authentic expression. Plan something spontaneous and watch the magic unfold.",
        "workPrediction": "Your energy is infectious in the workplace today, motivating your team to match your ambitious pace. Recognition for your efforts arrives sooner than expected.",
        "luckyNumbers": [
          12,
          32,
          61,
          82,
          93
        ],
        "luckyColor": "#FF9800"
      },
      "Taurus": {
        "date": "2026-02-11",
        "quote": "Luxury is the reward for those who work with intention.",
        "loveScore": 84,
        "workScore": 90,
        "healthScore": 87,
        "lovePrediction": "Sensuality is heightened today and physical affection brings you and your partner closer than words ever could. Let yourself enjoy the pleasure of simple, loving connection without overthinking it.",
        "workPrediction": "A financial negotiation or salary-related conversation goes in your favor. Your research and preparation demonstrate your serious commitment to your professional worth.",
        "luckyNumbers": [
          17,
          20,
          60,
          62,
          77
        ],
        "luckyColor": "#F48FB1"
      },
      "Gemini": {
        "date": "2026-02-11",
        "quote": "You don't just think outside the box — you redesign it.",
        "loveScore": 75,
        "workScore": 86,
        "healthScore": 70,
        "lovePrediction": "Honesty in love creates the safety net that allows both of you to soar. Share something real today and receive the intimacy that only truth can create.",
        "workPrediction": "Your versatility shines today as you seamlessly move between very different types of tasks without losing effectiveness. This adaptability is a rare professional superpower.",
        "luckyNumbers": [
          45,
          57,
          72,
          87,
          95
        ],
        "luckyColor": "#FFBF00"
      },
      "Cancer": {
        "date": "2026-02-11",
        "quote": "Tenderness and strength are not opposites — you embody both.",
        "loveScore": 71,
        "workScore": 71,
        "healthScore": 90,
        "lovePrediction": "Your emotional intuition is tuned perfectly today, allowing you to sense what your loved one needs before they speak it. This profound attunement deepens your bond in ways words never could.",
        "workPrediction": "Creative projects benefit from your intuitive approach today. Trust the hunches that guide your professional choices — your instincts have an impressive track record.",
        "luckyNumbers": [
          29,
          43,
          60,
          80,
          84
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-11",
        "quote": "Rule your kingdom with grace, courage, and an open heart.",
        "loveScore": 70,
        "workScore": 72,
        "healthScore": 88,
        "lovePrediction": "Your partner admires your confidence but craves your vulnerability too. Share your softer side today and watch your bond deepen to something truly magnificent.",
        "workPrediction": "Creative work receives outstanding recognition today. Your bold and original approach to a project stands out dramatically from the competition and earns well-deserved acclaim.",
        "luckyNumbers": [
          6,
          27,
          48,
          58,
          98
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-11",
        "quote": "You don't just fix things; you make them extraordinary.",
        "loveScore": 92,
        "workScore": 73,
        "healthScore": 71,
        "lovePrediction": "Your discerning heart recognizes quality when it sees it, and today you see it clearly. Trust your careful assessment of someone's character before investing your precious heart.",
        "workPrediction": "Helpful feedback you provide today creates a significant improvement in how your team operates. Your willingness to speak constructively is one of your most valuable professional gifts.",
        "luckyNumbers": [
          14,
          38,
          61,
          83,
          84
        ],
        "luckyColor": "#228B22"
      },
      "Libra": {
        "date": "2026-02-11",
        "quote": "Balance is not found — it is created by hands like yours.",
        "loveScore": 93,
        "workScore": 82,
        "healthScore": 78,
        "lovePrediction": "A decision about love becomes clearer today as your famous discernment cuts through confusion. Trust the verdict of your balanced heart — it always finds the fairest answer.",
        "workPrediction": "Your ability to present information fairly and persuasively makes today's professional meeting a success. Decision-makers trust your balanced assessment and act accordingly.",
        "luckyNumbers": [
          12,
          44,
          54,
          75,
          81
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-11",
        "quote": "Your perception sees what others dare not look at.",
        "loveScore": 88,
        "workScore": 90,
        "healthScore": 95,
        "lovePrediction": "Intense and transformative energy surges through your love life today. A soul-deep connection either deepens magnificently or a necessary truth finally surfaces. Either way, you grow.",
        "workPrediction": "A power dynamic at work shifts in your favor today. Your quiet observation and patient timing deliver the professional result you've been strategically positioning yourself for.",
        "luckyNumbers": [
          5,
          29,
          35,
          52,
          53
        ],
        "luckyColor": "#8B0000"
      },
      "Sagittarius": {
        "date": "2026-02-11",
        "quote": "Your philosophical mind finds meaning in every moment.",
        "loveScore": 95,
        "workScore": 75,
        "healthScore": 73,
        "lovePrediction": "Freedom and love are not opposites in your world — you prove today that the most liberating thing is being fully yourself with someone who celebrates exactly that.",
        "workPrediction": "An international or cross-cultural professional opportunity excites your expansive mind today. Your comfort with diverse perspectives makes you the ideal candidate for this kind of work.",
        "luckyNumbers": [
          8,
          27,
          50,
          65,
          67
        ],
        "luckyColor": "#0F52BA"
      },
      "Capricorn": {
        "date": "2026-02-11",
        "quote": "You are the architect of your own extraordinary life.",
        "loveScore": 85,
        "workScore": 75,
        "healthScore": 71,
        "lovePrediction": "Quality time over quantity is your love language today. A focused, device-free evening with your partner accomplishes more romantic progress than a month of rushed moments.",
        "workPrediction": "Your authority in your field is recognized today in a way that brings both professional and personal satisfaction. This validation confirms you are exactly where your effort was meant to take you.",
        "luckyNumbers": [
          5,
          28,
          46,
          55,
          96
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-11",
        "quote": "Community built on truth is your life's greatest work.",
        "loveScore": 71,
        "workScore": 75,
        "healthScore": 89,
        "lovePrediction": "Your visionary heart seeks a partner who dreams as boldly as you do, and today you get a glimpse of that perfect alignment. Trust that the universe is guiding this one perfectly.",
        "workPrediction": "A technology or systems improvement you've been advocating for finally gets implemented today. Your persistence in championing better ways of working creates lasting positive impact.",
        "luckyNumbers": [
          6,
          12,
          19,
          46,
          72
        ],
        "luckyColor": "#0F52BA"
      },
      "Pisces": {
        "date": "2026-02-11",
        "quote": "The mystical speaks your language and you hear it clearly.",
        "loveScore": 85,
        "workScore": 78,
        "healthScore": 80,
        "lovePrediction": "Your romantic imagination creates a love story so beautiful today that reality is moved to match it. Trust the dreams your heart sends you — they are not fantasies but blueprints.",
        "workPrediction": "Your compassionate approach to a workplace challenge creates a solution that heals as well as it solves. This is the unique professional gift that sets you apart from everyone else.",
        "luckyNumbers": [
          9,
          28,
          37,
          38,
          94
        ],
        "luckyColor": "#B8C4D8"
      }
    }
  },
  {
    "date": "2026-02-12",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-12",
        "quote": "The universe rewards those who act with fearless intention.",
        "loveScore": 92,
        "workScore": 72,
        "healthScore": 85,
        "lovePrediction": "Romance is heating up in your world today. Your natural charisma creates electric chemistry with someone who matches your fire. Trust your instincts about who deserves your heart.",
        "workPrediction": "A negotiation or presentation goes powerfully in your favor. Your directness and preparation combine for a result that advances your career in meaningful ways.",
        "luckyNumbers": [
          12,
          31,
          59,
          64,
          99
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-12",
        "quote": "Your calm in the storm anchors everyone around you.",
        "loveScore": 72,
        "workScore": 88,
        "healthScore": 76,
        "lovePrediction": "An honest conversation about your needs and desires strengthens your partnership today. Vulnerability builds the kind of trust that makes love lasting and real.",
        "workPrediction": "Your methodical work style produces results that speak for themselves today. The quality and consistency of your output builds the professional reputation you deserve.",
        "luckyNumbers": [
          7,
          48,
          49,
          52,
          83
        ],
        "luckyColor": "#F48FB1"
      },
      "Gemini": {
        "date": "2026-02-12",
        "quote": "Connection is your currency; spend it generously.",
        "loveScore": 82,
        "workScore": 83,
        "healthScore": 78,
        "lovePrediction": "Witty banter and intellectual chemistry spark something wonderful in your love life today. A stimulating conversation with a potential partner reveals surprising depths of compatibility. Keep talking.",
        "workPrediction": "Multitasking efficiency reaches an impressive peak today. You handle several complex tasks simultaneously without losing quality, demonstrating the versatility that makes you indispensable.",
        "luckyNumbers": [
          37,
          42,
          58,
          77,
          89
        ],
        "luckyColor": "#FF7F50"
      },
      "Cancer": {
        "date": "2026-02-12",
        "quote": "Let your heart lead; it has never once steered you wrong.",
        "loveScore": 93,
        "workScore": 77,
        "healthScore": 85,
        "lovePrediction": "Emotional conversations held today have the power to heal old wounds and create new levels of intimacy. Allow yourself to be both the one who comforts and the one who is comforted.",
        "workPrediction": "Your natural caregiving energy makes you an exceptional team member today. Colleagues feel supported and motivated, which reflects beautifully in the collective output.",
        "luckyNumbers": [
          8,
          9,
          25,
          40,
          49
        ],
        "luckyColor": "#40E0D0"
      },
      "Leo": {
        "date": "2026-02-12",
        "quote": "Your presence is a standing ovation waiting to happen.",
        "loveScore": 83,
        "workScore": 87,
        "healthScore": 71,
        "lovePrediction": "Romance is theatrical and thrilling today in the very best way. Lean into the drama of love — plan something memorable that shows your partner how much you cherish them.",
        "workPrediction": "Mentoring someone at work brings you the deepest professional satisfaction today. Your natural generosity of spirit creates an impact on this person that extends far beyond the workday.",
        "luckyNumbers": [
          24,
          58,
          71,
          84,
          94
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-12",
        "quote": "Your quiet genius speaks louder than any boast.",
        "loveScore": 83,
        "workScore": 74,
        "healthScore": 95,
        "lovePrediction": "Romance is in the practical details today — a perfectly timed cup of tea, a remembered appointment, a worry addressed before it was spoken. These are your love letters.",
        "workPrediction": "Your systematic approach to a new challenge produces a plan so thorough that your superiors immediately trust you to implement it independently. Confidence well placed in you.",
        "luckyNumbers": [
          7,
          33,
          49,
          51,
          60
        ],
        "luckyColor": "#0F52BA"
      },
      "Libra": {
        "date": "2026-02-12",
        "quote": "Your grace turns conflict into collaboration effortlessly.",
        "loveScore": 78,
        "workScore": 78,
        "healthScore": 70,
        "lovePrediction": "Harmony and romance dance together beautifully in your life today. Your natural grace creates an environment where love feels safe, beautiful, and deeply fulfilling.",
        "workPrediction": "A collaborative project thrives under your facilitative leadership today. Your ability to bring out the best in everyone around you creates results greater than any individual could achieve.",
        "luckyNumbers": [
          6,
          36,
          54,
          75,
          82
        ],
        "luckyColor": "#E6E6FA"
      },
      "Scorpio": {
        "date": "2026-02-12",
        "quote": "From every ending you rise more powerful than before.",
        "loveScore": 91,
        "workScore": 77,
        "healthScore": 89,
        "lovePrediction": "Emotional honesty, though challenging for your privacy-loving soul, creates the kind of intimacy you crave most. Take the risk of being seen completely — it's worth it.",
        "workPrediction": "Your intensity and focus allow you to accomplish in one day what others would spread over a week. This level of concentrated effort does not go unnoticed by those who matter.",
        "luckyNumbers": [
          23,
          28,
          53,
          79,
          96
        ],
        "luckyColor": "#9C27B0"
      },
      "Sagittarius": {
        "date": "2026-02-12",
        "quote": "Joy is your compass; follow it without hesitation.",
        "loveScore": 73,
        "workScore": 93,
        "healthScore": 73,
        "lovePrediction": "Your honesty, even when blunt, is the most attractive thing about you and someone in your world appreciates it profoundly today. Authenticity is your greatest romantic asset.",
        "workPrediction": "Educational or publishing opportunities in your professional sphere open up today. Your natural wisdom and communication skills position you perfectly to share what you know with a wider audience.",
        "luckyNumbers": [
          22,
          29,
          31,
          35,
          61
        ],
        "luckyColor": "#9C27B0"
      },
      "Capricorn": {
        "date": "2026-02-12",
        "quote": "Patience plus persistence equals the empire you're building.",
        "loveScore": 73,
        "workScore": 79,
        "healthScore": 95,
        "lovePrediction": "Commitment feels like a reward rather than a burden in your relationship today. Reaffirm your dedication and watch your partner's eyes light up with the certainty of being chosen.",
        "workPrediction": "A mentor or senior professional takes meaningful interest in your career today. The guidance they offer is gold — receive it with the humility and gratitude it deserves.",
        "luckyNumbers": [
          29,
          38,
          58,
          62,
          89
        ],
        "luckyColor": "#0F52BA"
      },
      "Aquarius": {
        "date": "2026-02-12",
        "quote": "You see the collective when others see only themselves.",
        "loveScore": 95,
        "workScore": 71,
        "healthScore": 79,
        "lovePrediction": "Intellectual attraction is the most powerful force in your romantic world today. A meeting of brilliant minds creates the kind of spark that doesn't easily fade.",
        "workPrediction": "Collaboration on a technology-forward or socially impactful project brings you both professional satisfaction and meaningful results. This is the kind of work your brilliant mind was made for.",
        "luckyNumbers": [
          15,
          18,
          32,
          34,
          53
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-12",
        "quote": "You are the bridge between the seen and unseen worlds.",
        "loveScore": 80,
        "workScore": 89,
        "healthScore": 74,
        "lovePrediction": "A spiritual or creative connection with someone new feels both familiar and thrillingly unknown. Your soul recognizes this meeting — trust the sacred feeling and follow its thread.",
        "workPrediction": "Imaginative work flourishes under your inspired guidance today. The solutions you generate feel almost magical to your more analytical colleagues, yet they are powerfully effective.",
        "luckyNumbers": [
          33,
          43,
          57,
          61,
          72
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-13",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-13",
        "quote": "Rise like the ram — steady, powerful, unstoppable.",
        "loveScore": 90,
        "workScore": 92,
        "healthScore": 86,
        "lovePrediction": "Passion and tenderness combine beautifully in your romantic life today. Express appreciation openly and watch your relationships flourish with warmth and renewed connection.",
        "workPrediction": "Leadership opportunities surface and you step into them naturally. Your colleagues benefit enormously from your decisive guidance and high energy today.",
        "luckyNumbers": [
          4,
          6,
          52,
          94,
          97
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-13",
        "quote": "Every seed of effort you plant today ripens beautifully.",
        "loveScore": 82,
        "workScore": 86,
        "healthScore": 90,
        "lovePrediction": "Slow and sensual energy surrounds your love life today. Take time to truly connect with your partner through touch, presence, and genuine appreciation. Quality time matters more than grand gestures right now.",
        "workPrediction": "Financial matters benefit from your careful and methodical review. A decision made with deliberation today protects and grows your resources beautifully.",
        "luckyNumbers": [
          22,
          28,
          43,
          70,
          85
        ],
        "luckyColor": "#C9A84C"
      },
      "Gemini": {
        "date": "2026-02-13",
        "quote": "Your energy lights up every room you walk into.",
        "loveScore": 95,
        "workScore": 82,
        "healthScore": 80,
        "lovePrediction": "Communication is your love language and today it flows beautifully. Express what you've been holding back and watch the space between you and your loved one dissolve.",
        "workPrediction": "Networking opens a significant professional door today. Your natural conversational gift creates connections that develop into valuable opportunities over the coming weeks.",
        "luckyNumbers": [
          34,
          38,
          49,
          85,
          90
        ],
        "luckyColor": "#40E0D0"
      },
      "Cancer": {
        "date": "2026-02-13",
        "quote": "You have the rare gift of making others feel truly seen.",
        "loveScore": 83,
        "workScore": 82,
        "healthScore": 86,
        "lovePrediction": "Your intuition leads you toward a meaningful romantic connection today. Trust the subtle feelings guiding your heart — they are far more reliable than logic in matters of love.",
        "workPrediction": "A long-term professional project you've been carefully tending is ready to bloom. Your patience and dedication have created something truly worth being proud of.",
        "luckyNumbers": [
          21,
          42,
          53,
          57,
          84
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-13",
        "quote": "Create boldly and let your art echo through the ages.",
        "loveScore": 88,
        "workScore": 88,
        "healthScore": 71,
        "lovePrediction": "Creative expression and romance intertwine beautifully today. Write a poem, sing a song, or simply speak your heart — your words of love are more powerful than you know.",
        "workPrediction": "Your ambitious goals receive a boost of momentum today as a key obstacle clears unexpectedly. Continue pushing forward with confidence — your dedication is about to be rewarded.",
        "luckyNumbers": [
          5,
          32,
          57,
          71,
          93
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-13",
        "quote": "Excellence lives in every choice you make today.",
        "loveScore": 88,
        "workScore": 77,
        "healthScore": 81,
        "lovePrediction": "Your acts of service speak the love your lips sometimes struggle to express today. A small, thoughtful gesture shows your partner more than any grand speech ever could.",
        "workPrediction": "A complex analytical task plays perfectly into your exceptional abilities today. The thoroughness of your work earns genuine admiration from those who understand what it took.",
        "luckyNumbers": [
          2,
          13,
          48,
          64,
          76
        ],
        "luckyColor": "#546E7A"
      },
      "Libra": {
        "date": "2026-02-13",
        "quote": "Beauty and justice are your twin guiding stars.",
        "loveScore": 92,
        "workScore": 83,
        "healthScore": 95,
        "lovePrediction": "For Librans seeking love, your natural magnetism is amplified today. Dress beautifully, smile genuinely, and trust that the universe is arranging a meaningful connection just for you.",
        "workPrediction": "An important professional relationship strengthens today through your sincere investment in mutual understanding. This connection will pay dividends in ways you can't yet fully predict.",
        "luckyNumbers": [
          2,
          34,
          51,
          55,
          94
        ],
        "luckyColor": "#E6E6FA"
      },
      "Scorpio": {
        "date": "2026-02-13",
        "quote": "Trust your instincts — they have never led you astray.",
        "loveScore": 89,
        "workScore": 74,
        "healthScore": 74,
        "lovePrediction": "Your perceptive nature sees beneath the surface of your romantic connections today, reading what isn't being said with impressive accuracy. Use this wisdom with gentleness.",
        "workPrediction": "Research-intensive work flourishes under your exacting attention today. Your thoroughness uncovers insights that fundamentally improve your project and demonstrate your exceptional value.",
        "luckyNumbers": [
          11,
          32,
          53,
          77,
          78
        ],
        "luckyColor": "#546E7A"
      },
      "Sagittarius": {
        "date": "2026-02-13",
        "quote": "The whole world is your classroom and you love every lesson.",
        "loveScore": 91,
        "workScore": 85,
        "healthScore": 92,
        "lovePrediction": "Your partner or romantic interest benefits from your uncanny ability to make them laugh and think at the same time. This combination of humor and depth is what makes you unforgettable.",
        "workPrediction": "Your optimism about a professional outcome proves well-founded as positive news arrives. Continue trusting your intuitive assessments — your gut reads the future accurately.",
        "luckyNumbers": [
          10,
          23,
          33,
          44,
          50
        ],
        "luckyColor": "#4B0082"
      },
      "Capricorn": {
        "date": "2026-02-13",
        "quote": "Your ambition is quiet, steady, and absolutely unstoppable.",
        "loveScore": 87,
        "workScore": 87,
        "healthScore": 80,
        "lovePrediction": "Love built on mutual respect and shared ambition deepens beautifully today. Your partner admires your dedication and feels inspired by your quiet strength. Show your appreciation in return.",
        "workPrediction": "A leadership opportunity materializes that aligns perfectly with your long-term career strategy. Step into it with the confidence of someone who has been preparing for exactly this.",
        "luckyNumbers": [
          11,
          61,
          68,
          70,
          94
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-13",
        "quote": "Radical compassion is your most revolutionary act.",
        "loveScore": 81,
        "workScore": 81,
        "healthScore": 83,
        "lovePrediction": "A humanitarian cause or shared interest brings you into close proximity with someone whose passion matches your own. This kind of attraction, rooted in shared purpose, is the most lasting.",
        "workPrediction": "Your unconventional approach is exactly what breaks a professional logjam that has frustrated everyone else. Original thinking is the rarest and most valuable professional commodity.",
        "luckyNumbers": [
          5,
          19,
          50,
          54,
          81
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-13",
        "quote": "Empathy is your lens and through it you see everything truly.",
        "loveScore": 77,
        "workScore": 87,
        "healthScore": 78,
        "lovePrediction": "Love today feels like a dream you hope you never wake from. Your sensitivity allows you to experience romantic connection at a depth most people only read about in poetry.",
        "workPrediction": "A spiritual or philosophical dimension of your work deepens your professional purpose today. When your work aligns with your soul, the quality becomes transcendent.",
        "luckyNumbers": [
          4,
          18,
          31,
          51,
          87
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-14",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-14",
        "quote": "Your energy is contagious; spread it generously today.",
        "loveScore": 73,
        "workScore": 87,
        "healthScore": 71,
        "lovePrediction": "Sparks fly when you least expect them today. Your magnetic energy draws someone special closer, creating a connection that feels both exciting and refreshingly new. Allow yourself to be vulnerable — it's your strength, not your weakness.",
        "workPrediction": "A competitive situation plays beautifully into your strengths. Channel your natural drive into focused action and you'll secure the outcome you've been working toward.",
        "luckyNumbers": [
          11,
          32,
          68,
          79,
          92
        ],
        "luckyColor": "#FF9800"
      },
      "Taurus": {
        "date": "2026-02-14",
        "quote": "You don't just survive; you thrive in your own time.",
        "loveScore": 92,
        "workScore": 85,
        "healthScore": 74,
        "lovePrediction": "A romantic gesture doesn't need to be elaborate to be meaningful. Cook a meal, write a note, or simply sit quietly together — your love language speaks through care.",
        "workPrediction": "Your reliability earns you a significant opportunity at work. Someone in a position of influence has been quietly observing your consistency and is ready to reward it.",
        "luckyNumbers": [
          2,
          18,
          46,
          54,
          74
        ],
        "luckyColor": "#546E7A"
      },
      "Gemini": {
        "date": "2026-02-14",
        "quote": "Brilliant ideas are born in the space between your thoughts.",
        "loveScore": 78,
        "workScore": 71,
        "healthScore": 73,
        "lovePrediction": "Your social energy attracts fascinating people today, and one connection feels particularly charged with romantic potential. Follow the thread of curiosity to see where it leads.",
        "workPrediction": "A writing, speaking, or communication-based project receives outstanding feedback. Your natural gift for words creates professional results that exceed expectations nicely.",
        "luckyNumbers": [
          10,
          17,
          20,
          42,
          59
        ],
        "luckyColor": "#FFBF00"
      },
      "Cancer": {
        "date": "2026-02-14",
        "quote": "Your love is the anchor that keeps others from drifting.",
        "loveScore": 84,
        "workScore": 74,
        "healthScore": 76,
        "lovePrediction": "A romantic daydream from this morning may very well be reality by evening. Your feelings are magnetic today and they draw matching energy toward you effortlessly.",
        "workPrediction": "Your memory for people's preferences and history makes you exceptionally effective at client relationships today. This personal touch generates professional loyalty that translates into real success.",
        "luckyNumbers": [
          5,
          18,
          28,
          71,
          74
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-14",
        "quote": "The lion doesn't need permission to be magnificent.",
        "loveScore": 92,
        "workScore": 74,
        "healthScore": 83,
        "lovePrediction": "Your radiance is impossible to ignore today and romance is sparked by your generous, sun-bright energy. Someone is captivated by the way you light up every room you enter.",
        "workPrediction": "Your generosity with credit and praise motivates your team to remarkable heights. True leaders lift others up, and today you do this beautifully and effectively.",
        "luckyNumbers": [
          6,
          14,
          16,
          71,
          99
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-14",
        "quote": "Excellence is not your standard; it's your natural state.",
        "loveScore": 73,
        "workScore": 76,
        "healthScore": 76,
        "lovePrediction": "A quiet evening of meaningful conversation reveals new layers in your relationship that thrill and deepen your connection. Your attention to detail makes your partner feel truly seen.",
        "workPrediction": "Your organizational skills bring order to a chaotic situation at work today, making the impossible feel manageable and earning you deep appreciation from your team.",
        "luckyNumbers": [
          27,
          39,
          54,
          83,
          87
        ],
        "luckyColor": "#B8C4D8"
      },
      "Libra": {
        "date": "2026-02-14",
        "quote": "Harmony begins within you and radiates outward.",
        "loveScore": 76,
        "workScore": 76,
        "healthScore": 89,
        "lovePrediction": "Balance in giving and receiving love creates the perfect romantic rhythm today. Allow yourself to receive as graciously as you give — your partner loves to cherish you too.",
        "workPrediction": "Partnership opportunities in your career sector open up today. Your collaborative nature and professional reputation attract exactly the kind of partner who will amplify your success.",
        "luckyNumbers": [
          21,
          44,
          59,
          83,
          84
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-14",
        "quote": "Passion is your language and the world is listening.",
        "loveScore": 79,
        "workScore": 81,
        "healthScore": 71,
        "lovePrediction": "Your seductive energy is operating at full power today, drawing the right kind of attention from the right kind of people. Be intentional about where you direct this magnetic force.",
        "workPrediction": "A career transformation begins in earnest today as you take the first concrete step toward the professional life you've been envisioning. Your determination will carry you all the way.",
        "luckyNumbers": [
          59,
          66,
          73,
          92,
          94
        ],
        "luckyColor": "#800000"
      },
      "Sagittarius": {
        "date": "2026-02-14",
        "quote": "Your laughter is medicine for those who've forgotten joy.",
        "loveScore": 70,
        "workScore": 83,
        "healthScore": 71,
        "lovePrediction": "Love feels like the greatest adventure today and you embrace it with your signature enthusiasm. A new romantic possibility excites both your heart and your wanderlust.",
        "workPrediction": "Your ability to see the big picture saves a project that got lost in the details today. Your strategic perspective realigns the team and restores momentum impressively.",
        "luckyNumbers": [
          1,
          13,
          26,
          45,
          69
        ],
        "luckyColor": "#E040FB"
      },
      "Capricorn": {
        "date": "2026-02-14",
        "quote": "The summit is closest to those who never stop climbing.",
        "loveScore": 74,
        "workScore": 92,
        "healthScore": 91,
        "lovePrediction": "Vulnerability in love does not compromise your strength; it elevates it. Sharing your deeper feelings with a trusted partner today creates a bond that will last decades.",
        "workPrediction": "Your reputation for reliability brings an important new responsibility your way today. The trust placed in you reflects years of professional integrity and it opens significant doors.",
        "luckyNumbers": [
          38,
          49,
          57,
          63,
          90
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-14",
        "quote": "Your unconventional thinking solves what convention cannot.",
        "loveScore": 83,
        "workScore": 78,
        "healthScore": 87,
        "lovePrediction": "Your authentic self is your most magnetic quality and today it shines brilliantly, attracting genuine admiration from someone who sees exactly who you are.",
        "workPrediction": "Your forward-thinking contributions to a team project are the element that transforms good into exceptional. The future belongs to visionaries and today you demonstrate exactly why.",
        "luckyNumbers": [
          50,
          68,
          72,
          75,
          87
        ],
        "luckyColor": "#9C27B0"
      },
      "Pisces": {
        "date": "2026-02-14",
        "quote": "Your art heals wounds that words alone cannot reach.",
        "loveScore": 86,
        "workScore": 93,
        "healthScore": 87,
        "lovePrediction": "Soft, poetic love is your specialty and today you express it with particular grace. Your partner feels wrapped in something luminous — which is exactly what love looks like through your eyes.",
        "workPrediction": "Your imaginative approach to a practical problem delights everyone involved today. The unexpected beauty and functionality of your solution is vintage Pisces genius.",
        "luckyNumbers": [
          15,
          32,
          48,
          51,
          68
        ],
        "luckyColor": "#9C27B0"
      }
    }
  },
  {
    "date": "2026-02-15",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-15",
        "quote": "Victory belongs to those who refuse to stand still.",
        "loveScore": 73,
        "workScore": 87,
        "healthScore": 80,
        "lovePrediction": "In existing relationships, passion surges and intimacy deepens when you lead with authentic expression. Plan something spontaneous and watch the magic unfold.",
        "workPrediction": "Your energy is infectious in the workplace today, motivating your team to match your ambitious pace. Recognition for your efforts arrives sooner than expected.",
        "luckyNumbers": [
          10,
          13,
          32,
          38,
          42
        ],
        "luckyColor": "#8B0000"
      },
      "Taurus": {
        "date": "2026-02-15",
        "quote": "The earth beneath you supports every dream you dare to plant.",
        "loveScore": 94,
        "workScore": 92,
        "healthScore": 81,
        "lovePrediction": "Sensuality is heightened today and physical affection brings you and your partner closer than words ever could. Let yourself enjoy the pleasure of simple, loving connection without overthinking it.",
        "workPrediction": "A financial negotiation or salary-related conversation goes in your favor. Your research and preparation demonstrate your serious commitment to your professional worth.",
        "luckyNumbers": [
          8,
          33,
          44,
          58,
          66
        ],
        "luckyColor": "#50C878"
      },
      "Gemini": {
        "date": "2026-02-15",
        "quote": "You are a bridge between worlds, ideas, and people.",
        "loveScore": 91,
        "workScore": 71,
        "healthScore": 87,
        "lovePrediction": "Honesty in love creates the safety net that allows both of you to soar. Share something real today and receive the intimacy that only truth can create.",
        "workPrediction": "Your versatility shines today as you seamlessly move between very different types of tasks without losing effectiveness. This adaptability is a rare professional superpower.",
        "luckyNumbers": [
          4,
          19,
          28,
          29,
          54
        ],
        "luckyColor": "#FF9800"
      },
      "Cancer": {
        "date": "2026-02-15",
        "quote": "Water carves through rock with patience — so do you.",
        "loveScore": 74,
        "workScore": 71,
        "healthScore": 95,
        "lovePrediction": "Your emotional intuition is tuned perfectly today, allowing you to sense what your loved one needs before they speak it. This profound attunement deepens your bond in ways words never could.",
        "workPrediction": "Creative projects benefit from your intuitive approach today. Trust the hunches that guide your professional choices — your instincts have an impressive track record.",
        "luckyNumbers": [
          40,
          45,
          52,
          70,
          89
        ],
        "luckyColor": "#00BCD4"
      },
      "Leo": {
        "date": "2026-02-15",
        "quote": "You radiate possibilities everywhere you go.",
        "loveScore": 75,
        "workScore": 94,
        "healthScore": 72,
        "lovePrediction": "Your partner admires your confidence but craves your vulnerability too. Share your softer side today and watch your bond deepen to something truly magnificent.",
        "workPrediction": "Creative work receives outstanding recognition today. Your bold and original approach to a project stands out dramatically from the competition and earns well-deserved acclaim.",
        "luckyNumbers": [
          14,
          24,
          71,
          77,
          91
        ],
        "luckyColor": "#FF9800"
      },
      "Virgo": {
        "date": "2026-02-15",
        "quote": "Every detail you notice is a gift to the bigger picture.",
        "loveScore": 75,
        "workScore": 92,
        "healthScore": 72,
        "lovePrediction": "Your discerning heart recognizes quality when it sees it, and today you see it clearly. Trust your careful assessment of someone's character before investing your precious heart.",
        "workPrediction": "Helpful feedback you provide today creates a significant improvement in how your team operates. Your willingness to speak constructively is one of your most valuable professional gifts.",
        "luckyNumbers": [
          24,
          38,
          50,
          67,
          80
        ],
        "luckyColor": "#00695C"
      },
      "Libra": {
        "date": "2026-02-15",
        "quote": "Your diplomacy builds bridges where walls once stood.",
        "loveScore": 94,
        "workScore": 73,
        "healthScore": 78,
        "lovePrediction": "A decision about love becomes clearer today as your famous discernment cuts through confusion. Trust the verdict of your balanced heart — it always finds the fairest answer.",
        "workPrediction": "Your ability to present information fairly and persuasively makes today's professional meeting a success. Decision-makers trust your balanced assessment and act accordingly.",
        "luckyNumbers": [
          21,
          52,
          78,
          82,
          97
        ],
        "luckyColor": "#00BCD4"
      },
      "Scorpio": {
        "date": "2026-02-15",
        "quote": "You dive into the deep end of life and bring back treasure.",
        "loveScore": 94,
        "workScore": 79,
        "healthScore": 85,
        "lovePrediction": "Intense and transformative energy surges through your love life today. A soul-deep connection either deepens magnificently or a necessary truth finally surfaces. Either way, you grow.",
        "workPrediction": "A power dynamic at work shifts in your favor today. Your quiet observation and patient timing deliver the professional result you've been strategically positioning yourself for.",
        "luckyNumbers": [
          1,
          32,
          36,
          55,
          81
        ],
        "luckyColor": "#0F52BA"
      },
      "Sagittarius": {
        "date": "2026-02-15",
        "quote": "Wanderlust is wisdom in motion — keep moving forward.",
        "loveScore": 80,
        "workScore": 85,
        "healthScore": 75,
        "lovePrediction": "Freedom and love are not opposites in your world — you prove today that the most liberating thing is being fully yourself with someone who celebrates exactly that.",
        "workPrediction": "An international or cross-cultural professional opportunity excites your expansive mind today. Your comfort with diverse perspectives makes you the ideal candidate for this kind of work.",
        "luckyNumbers": [
          30,
          48,
          58,
          64,
          82
        ],
        "luckyColor": "#9C27B0"
      },
      "Capricorn": {
        "date": "2026-02-15",
        "quote": "Discipline is not sacrifice — it is the highest self-respect.",
        "loveScore": 84,
        "workScore": 84,
        "healthScore": 77,
        "lovePrediction": "Quality time over quantity is your love language today. A focused, device-free evening with your partner accomplishes more romantic progress than a month of rushed moments.",
        "workPrediction": "Your authority in your field is recognized today in a way that brings both professional and personal satisfaction. This validation confirms you are exactly where your effort was meant to take you.",
        "luckyNumbers": [
          34,
          37,
          61,
          71,
          93
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-15",
        "quote": "Progress lives in the minds of those who dare to imagine.",
        "loveScore": 86,
        "workScore": 87,
        "healthScore": 89,
        "lovePrediction": "Your visionary heart seeks a partner who dreams as boldly as you do, and today you get a glimpse of that perfect alignment. Trust that the universe is guiding this one perfectly.",
        "workPrediction": "A technology or systems improvement you've been advocating for finally gets implemented today. Your persistence in championing better ways of working creates lasting positive impact.",
        "luckyNumbers": [
          47,
          55,
          62,
          95,
          96
        ],
        "luckyColor": "#40E0D0"
      },
      "Pisces": {
        "date": "2026-02-15",
        "quote": "Let your imagination roam free — that's where your gold is.",
        "loveScore": 84,
        "workScore": 84,
        "healthScore": 70,
        "lovePrediction": "Your romantic imagination creates a love story so beautiful today that reality is moved to match it. Trust the dreams your heart sends you — they are not fantasies but blueprints.",
        "workPrediction": "Your compassionate approach to a workplace challenge creates a solution that heals as well as it solves. This is the unique professional gift that sets you apart from everyone else.",
        "luckyNumbers": [
          2,
          38,
          47,
          48,
          82
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-16",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-16",
        "quote": "Break through barriers with the force of your conviction.",
        "loveScore": 73,
        "workScore": 78,
        "healthScore": 73,
        "lovePrediction": "Romance is heating up in your world today. Your natural charisma creates electric chemistry with someone who matches your fire. Trust your instincts about who deserves your heart.",
        "workPrediction": "A negotiation or presentation goes powerfully in your favor. Your directness and preparation combine for a result that advances your career in meaningful ways.",
        "luckyNumbers": [
          5,
          7,
          47,
          80,
          95
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-16",
        "quote": "Resilience and grace — your two greatest gifts to the world.",
        "loveScore": 72,
        "workScore": 89,
        "healthScore": 87,
        "lovePrediction": "An honest conversation about your needs and desires strengthens your partnership today. Vulnerability builds the kind of trust that makes love lasting and real.",
        "workPrediction": "Your methodical work style produces results that speak for themselves today. The quality and consistency of your output builds the professional reputation you deserve.",
        "luckyNumbers": [
          5,
          15,
          29,
          42,
          59
        ],
        "luckyColor": "#228B22"
      },
      "Gemini": {
        "date": "2026-02-16",
        "quote": "The universe loves a curious mind — and yours is unmatched.",
        "loveScore": 77,
        "workScore": 88,
        "healthScore": 86,
        "lovePrediction": "Witty banter and intellectual chemistry spark something wonderful in your love life today. A stimulating conversation with a potential partner reveals surprising depths of compatibility. Keep talking.",
        "workPrediction": "Multitasking efficiency reaches an impressive peak today. You handle several complex tasks simultaneously without losing quality, demonstrating the versatility that makes you indispensable.",
        "luckyNumbers": [
          1,
          24,
          28,
          46,
          74
        ],
        "luckyColor": "#00BCD4"
      },
      "Cancer": {
        "date": "2026-02-16",
        "quote": "Nurture your dreams as lovingly as you nurture others.",
        "loveScore": 92,
        "workScore": 74,
        "healthScore": 85,
        "lovePrediction": "Emotional conversations held today have the power to heal old wounds and create new levels of intimacy. Allow yourself to be both the one who comforts and the one who is comforted.",
        "workPrediction": "Your natural caregiving energy makes you an exceptional team member today. Colleagues feel supported and motivated, which reflects beautifully in the collective output.",
        "luckyNumbers": [
          60,
          80,
          87,
          94,
          95
        ],
        "luckyColor": "#00BCD4"
      },
      "Leo": {
        "date": "2026-02-16",
        "quote": "Your fire lights the way for those still finding theirs.",
        "loveScore": 83,
        "workScore": 84,
        "healthScore": 93,
        "lovePrediction": "Romance is theatrical and thrilling today in the very best way. Lean into the drama of love — plan something memorable that shows your partner how much you cherish them.",
        "workPrediction": "Mentoring someone at work brings you the deepest professional satisfaction today. Your natural generosity of spirit creates an impact on this person that extends far beyond the workday.",
        "luckyNumbers": [
          45,
          60,
          87,
          92,
          93
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-16",
        "quote": "Precision and compassion make you a rare force for good.",
        "loveScore": 71,
        "workScore": 79,
        "healthScore": 87,
        "lovePrediction": "Romance is in the practical details today — a perfectly timed cup of tea, a remembered appointment, a worry addressed before it was spoken. These are your love letters.",
        "workPrediction": "Your systematic approach to a new challenge produces a plan so thorough that your superiors immediately trust you to implement it independently. Confidence well placed in you.",
        "luckyNumbers": [
          6,
          14,
          67,
          76,
          98
        ],
        "luckyColor": "#228B22"
      },
      "Libra": {
        "date": "2026-02-16",
        "quote": "Fairness is your compass in a world often lost.",
        "loveScore": 90,
        "workScore": 88,
        "healthScore": 92,
        "lovePrediction": "Harmony and romance dance together beautifully in your life today. Your natural grace creates an environment where love feels safe, beautiful, and deeply fulfilling.",
        "workPrediction": "A collaborative project thrives under your facilitative leadership today. Your ability to bring out the best in everyone around you creates results greater than any individual could achieve.",
        "luckyNumbers": [
          9,
          27,
          40,
          71,
          94
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-16",
        "quote": "Power wielded with integrity is your greatest gift.",
        "loveScore": 91,
        "workScore": 95,
        "healthScore": 86,
        "lovePrediction": "Emotional honesty, though challenging for your privacy-loving soul, creates the kind of intimacy you crave most. Take the risk of being seen completely — it's worth it.",
        "workPrediction": "Your intensity and focus allow you to accomplish in one day what others would spread over a week. This level of concentrated effort does not go unnoticed by those who matter.",
        "luckyNumbers": [
          36,
          40,
          62,
          73,
          88
        ],
        "luckyColor": "#DC143C"
      },
      "Sagittarius": {
        "date": "2026-02-16",
        "quote": "Your honesty, though sharp, is always a gift.",
        "loveScore": 76,
        "workScore": 75,
        "healthScore": 83,
        "lovePrediction": "Your honesty, even when blunt, is the most attractive thing about you and someone in your world appreciates it profoundly today. Authenticity is your greatest romantic asset.",
        "workPrediction": "Educational or publishing opportunities in your professional sphere open up today. Your natural wisdom and communication skills position you perfectly to share what you know with a wider audience.",
        "luckyNumbers": [
          8,
          40,
          63,
          97,
          99
        ],
        "luckyColor": "#00BCD4"
      },
      "Capricorn": {
        "date": "2026-02-16",
        "quote": "You earn every inch of success and wear it with dignity.",
        "loveScore": 80,
        "workScore": 92,
        "healthScore": 75,
        "lovePrediction": "Commitment feels like a reward rather than a burden in your relationship today. Reaffirm your dedication and watch your partner's eyes light up with the certainty of being chosen.",
        "workPrediction": "A mentor or senior professional takes meaningful interest in your career today. The guidance they offer is gold — receive it with the humility and gratitude it deserves.",
        "luckyNumbers": [
          8,
          10,
          24,
          82,
          95
        ],
        "luckyColor": "#228B22"
      },
      "Aquarius": {
        "date": "2026-02-16",
        "quote": "You are not ahead of your time — you are exactly on time.",
        "loveScore": 84,
        "workScore": 93,
        "healthScore": 95,
        "lovePrediction": "Intellectual attraction is the most powerful force in your romantic world today. A meeting of brilliant minds creates the kind of spark that doesn't easily fade.",
        "workPrediction": "Collaboration on a technology-forward or socially impactful project brings you both professional satisfaction and meaningful results. This is the kind of work your brilliant mind was made for.",
        "luckyNumbers": [
          39,
          53,
          65,
          86,
          93
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-16",
        "quote": "You live at the intersection of poetry and reality.",
        "loveScore": 91,
        "workScore": 76,
        "healthScore": 80,
        "lovePrediction": "A spiritual or creative connection with someone new feels both familiar and thrillingly unknown. Your soul recognizes this meeting — trust the sacred feeling and follow its thread.",
        "workPrediction": "Imaginative work flourishes under your inspired guidance today. The solutions you generate feel almost magical to your more analytical colleagues, yet they are powerfully effective.",
        "luckyNumbers": [
          28,
          47,
          50,
          84,
          86
        ],
        "luckyColor": "#9C27B0"
      }
    }
  },
  {
    "date": "2026-02-17",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-17",
        "quote": "Today's bold move is tomorrow's proud memory.",
        "loveScore": 72,
        "workScore": 80,
        "healthScore": 88,
        "lovePrediction": "Passion and tenderness combine beautifully in your romantic life today. Express appreciation openly and watch your relationships flourish with warmth and renewed connection.",
        "workPrediction": "Leadership opportunities surface and you step into them naturally. Your colleagues benefit enormously from your decisive guidance and high energy today.",
        "luckyNumbers": [
          37,
          50,
          75,
          79,
          99
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-17",
        "quote": "Your dedication turns ordinary days into extraordinary legacies.",
        "loveScore": 90,
        "workScore": 79,
        "healthScore": 89,
        "lovePrediction": "Slow and sensual energy surrounds your love life today. Take time to truly connect with your partner through touch, presence, and genuine appreciation. Quality time matters more than grand gestures right now.",
        "workPrediction": "Financial matters benefit from your careful and methodical review. A decision made with deliberation today protects and grows your resources beautifully.",
        "luckyNumbers": [
          23,
          30,
          47,
          56,
          78
        ],
        "luckyColor": "#228B22"
      },
      "Gemini": {
        "date": "2026-02-17",
        "quote": "Play with ideas freely; your best one is still coming.",
        "loveScore": 80,
        "workScore": 81,
        "healthScore": 77,
        "lovePrediction": "Communication is your love language and today it flows beautifully. Express what you've been holding back and watch the space between you and your loved one dissolve.",
        "workPrediction": "Networking opens a significant professional door today. Your natural conversational gift creates connections that develop into valuable opportunities over the coming weeks.",
        "luckyNumbers": [
          3,
          11,
          53,
          67,
          80
        ],
        "luckyColor": "#40E0D0"
      },
      "Cancer": {
        "date": "2026-02-17",
        "quote": "Your inner world is a treasure the outer world needs.",
        "loveScore": 79,
        "workScore": 75,
        "healthScore": 83,
        "lovePrediction": "Your intuition leads you toward a meaningful romantic connection today. Trust the subtle feelings guiding your heart — they are far more reliable than logic in matters of love.",
        "workPrediction": "A long-term professional project you've been carefully tending is ready to bloom. Your patience and dedication have created something truly worth being proud of.",
        "luckyNumbers": [
          3,
          31,
          34,
          52,
          64
        ],
        "luckyColor": "#E6E6FA"
      },
      "Leo": {
        "date": "2026-02-17",
        "quote": "You were born to shine — never apologize for your light.",
        "loveScore": 80,
        "workScore": 82,
        "healthScore": 72,
        "lovePrediction": "Creative expression and romance intertwine beautifully today. Write a poem, sing a song, or simply speak your heart — your words of love are more powerful than you know.",
        "workPrediction": "Your ambitious goals receive a boost of momentum today as a key obstacle clears unexpectedly. Continue pushing forward with confidence — your dedication is about to be rewarded.",
        "luckyNumbers": [
          7,
          27,
          58,
          83,
          84
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-17",
        "quote": "Your analytical mind solves what others cannot even see.",
        "loveScore": 81,
        "workScore": 76,
        "healthScore": 73,
        "lovePrediction": "Your acts of service speak the love your lips sometimes struggle to express today. A small, thoughtful gesture shows your partner more than any grand speech ever could.",
        "workPrediction": "A complex analytical task plays perfectly into your exceptional abilities today. The thoroughness of your work earns genuine admiration from those who understand what it took.",
        "luckyNumbers": [
          6,
          13,
          18,
          33,
          98
        ],
        "luckyColor": "#546E7A"
      },
      "Libra": {
        "date": "2026-02-17",
        "quote": "You see all sides — and that is your greatest strength.",
        "loveScore": 70,
        "workScore": 78,
        "healthScore": 81,
        "lovePrediction": "For Librans seeking love, your natural magnetism is amplified today. Dress beautifully, smile genuinely, and trust that the universe is arranging a meaningful connection just for you.",
        "workPrediction": "An important professional relationship strengthens today through your sincere investment in mutual understanding. This connection will pay dividends in ways you can't yet fully predict.",
        "luckyNumbers": [
          49,
          61,
          68,
          69,
          91
        ],
        "luckyColor": "#00BCD4"
      },
      "Scorpio": {
        "date": "2026-02-17",
        "quote": "Your loyalty is as fierce as your determination.",
        "loveScore": 88,
        "workScore": 91,
        "healthScore": 92,
        "lovePrediction": "Your perceptive nature sees beneath the surface of your romantic connections today, reading what isn't being said with impressive accuracy. Use this wisdom with gentleness.",
        "workPrediction": "Research-intensive work flourishes under your exacting attention today. Your thoroughness uncovers insights that fundamentally improve your project and demonstrate your exceptional value.",
        "luckyNumbers": [
          5,
          16,
          20,
          41,
          97
        ],
        "luckyColor": "#546E7A"
      },
      "Sagittarius": {
        "date": "2026-02-17",
        "quote": "The universe expands to match the size of your dreams.",
        "loveScore": 95,
        "workScore": 75,
        "healthScore": 77,
        "lovePrediction": "Your partner or romantic interest benefits from your uncanny ability to make them laugh and think at the same time. This combination of humor and depth is what makes you unforgettable.",
        "workPrediction": "Your optimism about a professional outcome proves well-founded as positive news arrives. Continue trusting your intuitive assessments — your gut reads the future accurately.",
        "luckyNumbers": [
          11,
          37,
          46,
          51,
          65
        ],
        "luckyColor": "#40E0D0"
      },
      "Capricorn": {
        "date": "2026-02-17",
        "quote": "Mastery comes to those who put in the hours — and you do.",
        "loveScore": 77,
        "workScore": 78,
        "healthScore": 81,
        "lovePrediction": "Love built on mutual respect and shared ambition deepens beautifully today. Your partner admires your dedication and feels inspired by your quiet strength. Show your appreciation in return.",
        "workPrediction": "A leadership opportunity materializes that aligns perfectly with your long-term career strategy. Step into it with the confidence of someone who has been preparing for exactly this.",
        "luckyNumbers": [
          13,
          27,
          33,
          40,
          61
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-17",
        "quote": "Your humanitarian heart makes the world more livable for all.",
        "loveScore": 72,
        "workScore": 80,
        "healthScore": 76,
        "lovePrediction": "A humanitarian cause or shared interest brings you into close proximity with someone whose passion matches your own. This kind of attraction, rooted in shared purpose, is the most lasting.",
        "workPrediction": "Your unconventional approach is exactly what breaks a professional logjam that has frustrated everyone else. Original thinking is the rarest and most valuable professional commodity.",
        "luckyNumbers": [
          27,
          35,
          43,
          67,
          82
        ],
        "luckyColor": "#0F52BA"
      },
      "Pisces": {
        "date": "2026-02-17",
        "quote": "Your compassionate heart transforms every room it enters.",
        "loveScore": 93,
        "workScore": 86,
        "healthScore": 85,
        "lovePrediction": "Love today feels like a dream you hope you never wake from. Your sensitivity allows you to experience romantic connection at a depth most people only read about in poetry.",
        "workPrediction": "A spiritual or philosophical dimension of your work deepens your professional purpose today. When your work aligns with your soul, the quality becomes transcendent.",
        "luckyNumbers": [
          24,
          35,
          46,
          61,
          94
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-18",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-18",
        "quote": "You are the spark that sets possibility ablaze.",
        "loveScore": 85,
        "workScore": 85,
        "healthScore": 88,
        "lovePrediction": "Sparks fly when you least expect them today. Your magnetic energy draws someone special closer, creating a connection that feels both exciting and refreshingly new. Allow yourself to be vulnerable — it's your strength, not your weakness.",
        "workPrediction": "A competitive situation plays beautifully into your strengths. Channel your natural drive into focused action and you'll secure the outcome you've been working toward.",
        "luckyNumbers": [
          35,
          46,
          68,
          76,
          97
        ],
        "luckyColor": "#FF9800"
      },
      "Taurus": {
        "date": "2026-02-18",
        "quote": "Stand firm in who you are; the world needs your strength.",
        "loveScore": 81,
        "workScore": 82,
        "healthScore": 89,
        "lovePrediction": "A romantic gesture doesn't need to be elaborate to be meaningful. Cook a meal, write a note, or simply sit quietly together — your love language speaks through care.",
        "workPrediction": "Your reliability earns you a significant opportunity at work. Someone in a position of influence has been quietly observing your consistency and is ready to reward it.",
        "luckyNumbers": [
          5,
          7,
          46,
          60,
          98
        ],
        "luckyColor": "#F48FB1"
      },
      "Gemini": {
        "date": "2026-02-18",
        "quote": "Your charm opens doors that talent alone cannot.",
        "loveScore": 92,
        "workScore": 86,
        "healthScore": 80,
        "lovePrediction": "Your social energy attracts fascinating people today, and one connection feels particularly charged with romantic potential. Follow the thread of curiosity to see where it leads.",
        "workPrediction": "A writing, speaking, or communication-based project receives outstanding feedback. Your natural gift for words creates professional results that exceed expectations nicely.",
        "luckyNumbers": [
          14,
          37,
          63,
          82,
          98
        ],
        "luckyColor": "#FFBF00"
      },
      "Cancer": {
        "date": "2026-02-18",
        "quote": "Intuition dressed in kindness — that's your magic.",
        "loveScore": 94,
        "workScore": 70,
        "healthScore": 90,
        "lovePrediction": "A romantic daydream from this morning may very well be reality by evening. Your feelings are magnetic today and they draw matching energy toward you effortlessly.",
        "workPrediction": "Your memory for people's preferences and history makes you exceptionally effective at client relationships today. This personal touch generates professional loyalty that translates into real success.",
        "luckyNumbers": [
          2,
          14,
          36,
          45,
          77
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-18",
        "quote": "The stage is set and the spotlight is yours by birthright.",
        "loveScore": 76,
        "workScore": 80,
        "healthScore": 87,
        "lovePrediction": "Your radiance is impossible to ignore today and romance is sparked by your generous, sun-bright energy. Someone is captivated by the way you light up every room you enter.",
        "workPrediction": "Your generosity with credit and praise motivates your team to remarkable heights. True leaders lift others up, and today you do this beautifully and effectively.",
        "luckyNumbers": [
          8,
          11,
          19,
          75,
          93
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-18",
        "quote": "Perfection is a journey and you travel it beautifully.",
        "loveScore": 85,
        "workScore": 70,
        "healthScore": 79,
        "lovePrediction": "A quiet evening of meaningful conversation reveals new layers in your relationship that thrill and deepen your connection. Your attention to detail makes your partner feel truly seen.",
        "workPrediction": "Your organizational skills bring order to a chaotic situation at work today, making the impossible feel manageable and earning you deep appreciation from your team.",
        "luckyNumbers": [
          10,
          23,
          30,
          64,
          97
        ],
        "luckyColor": "#228B22"
      },
      "Libra": {
        "date": "2026-02-18",
        "quote": "Love and balance together create your most beautiful days.",
        "loveScore": 92,
        "workScore": 87,
        "healthScore": 83,
        "lovePrediction": "Balance in giving and receiving love creates the perfect romantic rhythm today. Allow yourself to receive as graciously as you give — your partner loves to cherish you too.",
        "workPrediction": "Partnership opportunities in your career sector open up today. Your collaborative nature and professional reputation attract exactly the kind of partner who will amplify your success.",
        "luckyNumbers": [
          32,
          41,
          46,
          53,
          72
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-18",
        "quote": "Phoenix energy runs through every cell of your being.",
        "loveScore": 72,
        "workScore": 88,
        "healthScore": 70,
        "lovePrediction": "Your seductive energy is operating at full power today, drawing the right kind of attention from the right kind of people. Be intentional about where you direct this magnetic force.",
        "workPrediction": "A career transformation begins in earnest today as you take the first concrete step toward the professional life you've been envisioning. Your determination will carry you all the way.",
        "luckyNumbers": [
          3,
          19,
          45,
          71,
          89
        ],
        "luckyColor": "#8B0000"
      },
      "Sagittarius": {
        "date": "2026-02-18",
        "quote": "You inspire others simply by living your fullest life.",
        "loveScore": 95,
        "workScore": 71,
        "healthScore": 81,
        "lovePrediction": "Love feels like the greatest adventure today and you embrace it with your signature enthusiasm. A new romantic possibility excites both your heart and your wanderlust.",
        "workPrediction": "Your ability to see the big picture saves a project that got lost in the details today. Your strategic perspective realigns the team and restores momentum impressively.",
        "luckyNumbers": [
          5,
          45,
          64,
          81,
          93
        ],
        "luckyColor": "#0F52BA"
      },
      "Capricorn": {
        "date": "2026-02-18",
        "quote": "Your practical wisdom turns dreams into blueprints.",
        "loveScore": 90,
        "workScore": 91,
        "healthScore": 71,
        "lovePrediction": "Vulnerability in love does not compromise your strength; it elevates it. Sharing your deeper feelings with a trusted partner today creates a bond that will last decades.",
        "workPrediction": "Your reputation for reliability brings an important new responsibility your way today. The trust placed in you reflects years of professional integrity and it opens significant doors.",
        "luckyNumbers": [
          20,
          33,
          40,
          60,
          66
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-18",
        "quote": "Eccentricity is genius in its natural state — and you know it.",
        "loveScore": 91,
        "workScore": 75,
        "healthScore": 94,
        "lovePrediction": "Your authentic self is your most magnetic quality and today it shines brilliantly, attracting genuine admiration from someone who sees exactly who you are.",
        "workPrediction": "Your forward-thinking contributions to a team project are the element that transforms good into exceptional. The future belongs to visionaries and today you demonstrate exactly why.",
        "luckyNumbers": [
          45,
          56,
          62,
          71,
          90
        ],
        "luckyColor": "#0F52BA"
      },
      "Pisces": {
        "date": "2026-02-18",
        "quote": "In the depth of your feeling is the source of your wisdom.",
        "loveScore": 82,
        "workScore": 92,
        "healthScore": 72,
        "lovePrediction": "Soft, poetic love is your specialty and today you express it with particular grace. Your partner feels wrapped in something luminous — which is exactly what love looks like through your eyes.",
        "workPrediction": "Your imaginative approach to a practical problem delights everyone involved today. The unexpected beauty and functionality of your solution is vintage Pisces genius.",
        "luckyNumbers": [
          2,
          25,
          40,
          43,
          82
        ],
        "luckyColor": "#B8C4D8"
      }
    }
  },
  {
    "date": "2026-02-19",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-19",
        "quote": "Courage is not the absence of fear — it's your middle name.",
        "loveScore": 77,
        "workScore": 94,
        "healthScore": 84,
        "lovePrediction": "In existing relationships, passion surges and intimacy deepens when you lead with authentic expression. Plan something spontaneous and watch the magic unfold.",
        "workPrediction": "Your energy is infectious in the workplace today, motivating your team to match your ambitious pace. Recognition for your efforts arrives sooner than expected.",
        "luckyNumbers": [
          20,
          37,
          47,
          55,
          92
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-19",
        "quote": "Prosperity follows those who respect the journey.",
        "loveScore": 85,
        "workScore": 76,
        "healthScore": 84,
        "lovePrediction": "Sensuality is heightened today and physical affection brings you and your partner closer than words ever could. Let yourself enjoy the pleasure of simple, loving connection without overthinking it.",
        "workPrediction": "A financial negotiation or salary-related conversation goes in your favor. Your research and preparation demonstrate your serious commitment to your professional worth.",
        "luckyNumbers": [
          11,
          29,
          63,
          83,
          95
        ],
        "luckyColor": "#F48FB1"
      },
      "Gemini": {
        "date": "2026-02-19",
        "quote": "Explore boldly; you were born for discovery.",
        "loveScore": 83,
        "workScore": 79,
        "healthScore": 84,
        "lovePrediction": "Honesty in love creates the safety net that allows both of you to soar. Share something real today and receive the intimacy that only truth can create.",
        "workPrediction": "Your versatility shines today as you seamlessly move between very different types of tasks without losing effectiveness. This adaptability is a rare professional superpower.",
        "luckyNumbers": [
          11,
          19,
          29,
          70,
          97
        ],
        "luckyColor": "#FF7F50"
      },
      "Cancer": {
        "date": "2026-02-19",
        "quote": "Family, chosen or born, is your greatest masterpiece.",
        "loveScore": 81,
        "workScore": 84,
        "healthScore": 77,
        "lovePrediction": "Your emotional intuition is tuned perfectly today, allowing you to sense what your loved one needs before they speak it. This profound attunement deepens your bond in ways words never could.",
        "workPrediction": "Creative projects benefit from your intuitive approach today. Trust the hunches that guide your professional choices — your instincts have an impressive track record.",
        "luckyNumbers": [
          9,
          20,
          41,
          89,
          96
        ],
        "luckyColor": "#40E0D0"
      },
      "Leo": {
        "date": "2026-02-19",
        "quote": "Generosity of spirit is your most royal quality.",
        "loveScore": 77,
        "workScore": 92,
        "healthScore": 84,
        "lovePrediction": "Your partner admires your confidence but craves your vulnerability too. Share your softer side today and watch your bond deepen to something truly magnificent.",
        "workPrediction": "Creative work receives outstanding recognition today. Your bold and original approach to a project stands out dramatically from the competition and earns well-deserved acclaim.",
        "luckyNumbers": [
          5,
          10,
          40,
          85,
          97
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-19",
        "quote": "Service to others is the highest form of self-expression.",
        "loveScore": 89,
        "workScore": 79,
        "healthScore": 89,
        "lovePrediction": "Your discerning heart recognizes quality when it sees it, and today you see it clearly. Trust your careful assessment of someone's character before investing your precious heart.",
        "workPrediction": "Helpful feedback you provide today creates a significant improvement in how your team operates. Your willingness to speak constructively is one of your most valuable professional gifts.",
        "luckyNumbers": [
          25,
          32,
          71,
          77,
          97
        ],
        "luckyColor": "#0F52BA"
      },
      "Libra": {
        "date": "2026-02-19",
        "quote": "Your aesthetic eye transforms the ordinary into art.",
        "loveScore": 77,
        "workScore": 70,
        "healthScore": 87,
        "lovePrediction": "A decision about love becomes clearer today as your famous discernment cuts through confusion. Trust the verdict of your balanced heart — it always finds the fairest answer.",
        "workPrediction": "Your ability to present information fairly and persuasively makes today's professional meeting a success. Decision-makers trust your balanced assessment and act accordingly.",
        "luckyNumbers": [
          1,
          43,
          59,
          61,
          96
        ],
        "luckyColor": "#E6E6FA"
      },
      "Scorpio": {
        "date": "2026-02-19",
        "quote": "Mystery is not your shield; it is your invitation.",
        "loveScore": 86,
        "workScore": 95,
        "healthScore": 90,
        "lovePrediction": "Intense and transformative energy surges through your love life today. A soul-deep connection either deepens magnificently or a necessary truth finally surfaces. Either way, you grow.",
        "workPrediction": "A power dynamic at work shifts in your favor today. Your quiet observation and patient timing deliver the professional result you've been strategically positioning yourself for.",
        "luckyNumbers": [
          20,
          36,
          44,
          53,
          86
        ],
        "luckyColor": "#9C27B0"
      },
      "Sagittarius": {
        "date": "2026-02-19",
        "quote": "Every journey you take returns you a little more whole.",
        "loveScore": 91,
        "workScore": 71,
        "healthScore": 84,
        "lovePrediction": "Freedom and love are not opposites in your world — you prove today that the most liberating thing is being fully yourself with someone who celebrates exactly that.",
        "workPrediction": "An international or cross-cultural professional opportunity excites your expansive mind today. Your comfort with diverse perspectives makes you the ideal candidate for this kind of work.",
        "luckyNumbers": [
          10,
          31,
          75,
          85,
          98
        ],
        "luckyColor": "#9C27B0"
      },
      "Capricorn": {
        "date": "2026-02-19",
        "quote": "Time is your greatest ally when you use it with intention.",
        "loveScore": 88,
        "workScore": 94,
        "healthScore": 95,
        "lovePrediction": "Quality time over quantity is your love language today. A focused, device-free evening with your partner accomplishes more romantic progress than a month of rushed moments.",
        "workPrediction": "Your authority in your field is recognized today in a way that brings both professional and personal satisfaction. This validation confirms you are exactly where your effort was meant to take you.",
        "luckyNumbers": [
          15,
          25,
          67,
          91,
          94
        ],
        "luckyColor": "#0F52BA"
      },
      "Aquarius": {
        "date": "2026-02-19",
        "quote": "The wave of change crests with you riding at the front.",
        "loveScore": 78,
        "workScore": 72,
        "healthScore": 74,
        "lovePrediction": "Your visionary heart seeks a partner who dreams as boldly as you do, and today you get a glimpse of that perfect alignment. Trust that the universe is guiding this one perfectly.",
        "workPrediction": "A technology or systems improvement you've been advocating for finally gets implemented today. Your persistence in championing better ways of working creates lasting positive impact.",
        "luckyNumbers": [
          11,
          13,
          47,
          83,
          91
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-19",
        "quote": "You don't just observe beauty — you create it effortlessly.",
        "loveScore": 73,
        "workScore": 93,
        "healthScore": 89,
        "lovePrediction": "Your romantic imagination creates a love story so beautiful today that reality is moved to match it. Trust the dreams your heart sends you — they are not fantasies but blueprints.",
        "workPrediction": "Your compassionate approach to a workplace challenge creates a solution that heals as well as it solves. This is the unique professional gift that sets you apart from everyone else.",
        "luckyNumbers": [
          5,
          41,
          80,
          83,
          95
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-20",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-20",
        "quote": "Move mountains with the relentless force of your will.",
        "loveScore": 77,
        "workScore": 72,
        "healthScore": 95,
        "lovePrediction": "Romance is heating up in your world today. Your natural charisma creates electric chemistry with someone who matches your fire. Trust your instincts about who deserves your heart.",
        "workPrediction": "A negotiation or presentation goes powerfully in your favor. Your directness and preparation combine for a result that advances your career in meaningful ways.",
        "luckyNumbers": [
          13,
          20,
          26,
          64,
          94
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-20",
        "quote": "Your sensibility is a compass others wish they had.",
        "loveScore": 92,
        "workScore": 75,
        "healthScore": 86,
        "lovePrediction": "An honest conversation about your needs and desires strengthens your partnership today. Vulnerability builds the kind of trust that makes love lasting and real.",
        "workPrediction": "Your methodical work style produces results that speak for themselves today. The quality and consistency of your output builds the professional reputation you deserve.",
        "luckyNumbers": [
          4,
          61,
          82,
          92,
          93
        ],
        "luckyColor": "#C9A84C"
      },
      "Gemini": {
        "date": "2026-02-20",
        "quote": "Every question you ask leads to a beautiful answer.",
        "loveScore": 79,
        "workScore": 85,
        "healthScore": 87,
        "lovePrediction": "Witty banter and intellectual chemistry spark something wonderful in your love life today. A stimulating conversation with a potential partner reveals surprising depths of compatibility. Keep talking.",
        "workPrediction": "Multitasking efficiency reaches an impressive peak today. You handle several complex tasks simultaneously without losing quality, demonstrating the versatility that makes you indispensable.",
        "luckyNumbers": [
          14,
          56,
          61,
          80,
          97
        ],
        "luckyColor": "#40E0D0"
      },
      "Cancer": {
        "date": "2026-02-20",
        "quote": "Your heart holds more wisdom than a thousand books.",
        "loveScore": 70,
        "workScore": 92,
        "healthScore": 85,
        "lovePrediction": "Emotional conversations held today have the power to heal old wounds and create new levels of intimacy. Allow yourself to be both the one who comforts and the one who is comforted.",
        "workPrediction": "Your natural caregiving energy makes you an exceptional team member today. Colleagues feel supported and motivated, which reflects beautifully in the collective output.",
        "luckyNumbers": [
          12,
          28,
          67,
          94,
          95
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-20",
        "quote": "Lead with love and command the loyalty of the world.",
        "loveScore": 94,
        "workScore": 74,
        "healthScore": 84,
        "lovePrediction": "Romance is theatrical and thrilling today in the very best way. Lean into the drama of love — plan something memorable that shows your partner how much you cherish them.",
        "workPrediction": "Mentoring someone at work brings you the deepest professional satisfaction today. Your natural generosity of spirit creates an impact on this person that extends far beyond the workday.",
        "luckyNumbers": [
          15,
          39,
          42,
          47,
          62
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-20",
        "quote": "Your discernment saves others from costly mistakes.",
        "loveScore": 86,
        "workScore": 78,
        "healthScore": 95,
        "lovePrediction": "Romance is in the practical details today — a perfectly timed cup of tea, a remembered appointment, a worry addressed before it was spoken. These are your love letters.",
        "workPrediction": "Your systematic approach to a new challenge produces a plan so thorough that your superiors immediately trust you to implement it independently. Confidence well placed in you.",
        "luckyNumbers": [
          23,
          37,
          72,
          96,
          98
        ],
        "luckyColor": "#546E7A"
      },
      "Libra": {
        "date": "2026-02-20",
        "quote": "Justice flows naturally through your every decision.",
        "loveScore": 75,
        "workScore": 82,
        "healthScore": 88,
        "lovePrediction": "Harmony and romance dance together beautifully in your life today. Your natural grace creates an environment where love feels safe, beautiful, and deeply fulfilling.",
        "workPrediction": "A collaborative project thrives under your facilitative leadership today. Your ability to bring out the best in everyone around you creates results greater than any individual could achieve.",
        "luckyNumbers": [
          21,
          29,
          33,
          67,
          69
        ],
        "luckyColor": "#E6E6FA"
      },
      "Scorpio": {
        "date": "2026-02-20",
        "quote": "You heal by going where others fear to look.",
        "loveScore": 83,
        "workScore": 77,
        "healthScore": 74,
        "lovePrediction": "Emotional honesty, though challenging for your privacy-loving soul, creates the kind of intimacy you crave most. Take the risk of being seen completely — it's worth it.",
        "workPrediction": "Your intensity and focus allow you to accomplish in one day what others would spread over a week. This level of concentrated effort does not go unnoticed by those who matter.",
        "luckyNumbers": [
          4,
          25,
          28,
          30,
          53
        ],
        "luckyColor": "#546E7A"
      },
      "Sagittarius": {
        "date": "2026-02-20",
        "quote": "Optimism is not naivety — it is your greatest strategy.",
        "loveScore": 73,
        "workScore": 77,
        "healthScore": 76,
        "lovePrediction": "Your honesty, even when blunt, is the most attractive thing about you and someone in your world appreciates it profoundly today. Authenticity is your greatest romantic asset.",
        "workPrediction": "Educational or publishing opportunities in your professional sphere open up today. Your natural wisdom and communication skills position you perfectly to share what you know with a wider audience.",
        "luckyNumbers": [
          4,
          14,
          38,
          51,
          52
        ],
        "luckyColor": "#4B0082"
      },
      "Capricorn": {
        "date": "2026-02-20",
        "quote": "The mountain does not move — but you do, one step at a time.",
        "loveScore": 77,
        "workScore": 76,
        "healthScore": 89,
        "lovePrediction": "Commitment feels like a reward rather than a burden in your relationship today. Reaffirm your dedication and watch your partner's eyes light up with the certainty of being chosen.",
        "workPrediction": "A mentor or senior professional takes meaningful interest in your career today. The guidance they offer is gold — receive it with the humility and gratitude it deserves.",
        "luckyNumbers": [
          10,
          46,
          49,
          76,
          91
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-20",
        "quote": "Your friendship is rare and those who have it are blessed.",
        "loveScore": 83,
        "workScore": 79,
        "healthScore": 78,
        "lovePrediction": "Intellectual attraction is the most powerful force in your romantic world today. A meeting of brilliant minds creates the kind of spark that doesn't easily fade.",
        "workPrediction": "Collaboration on a technology-forward or socially impactful project brings you both professional satisfaction and meaningful results. This is the kind of work your brilliant mind was made for.",
        "luckyNumbers": [
          6,
          36,
          47,
          62,
          99
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-20",
        "quote": "Your soul speaks in metaphors the heart understands perfectly.",
        "loveScore": 78,
        "workScore": 76,
        "healthScore": 70,
        "lovePrediction": "A spiritual or creative connection with someone new feels both familiar and thrillingly unknown. Your soul recognizes this meeting — trust the sacred feeling and follow its thread.",
        "workPrediction": "Imaginative work flourishes under your inspired guidance today. The solutions you generate feel almost magical to your more analytical colleagues, yet they are powerfully effective.",
        "luckyNumbers": [
          37,
          84,
          89,
          92,
          96
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-21",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-21",
        "quote": "Your fire doesn't flicker; it roars.",
        "loveScore": 71,
        "workScore": 87,
        "healthScore": 71,
        "lovePrediction": "Passion and tenderness combine beautifully in your romantic life today. Express appreciation openly and watch your relationships flourish with warmth and renewed connection.",
        "workPrediction": "Leadership opportunities surface and you step into them naturally. Your colleagues benefit enormously from your decisive guidance and high energy today.",
        "luckyNumbers": [
          7,
          20,
          27,
          85,
          98
        ],
        "luckyColor": "#FF9800"
      },
      "Taurus": {
        "date": "2026-02-21",
        "quote": "Value yourself as richly as you value those you love.",
        "loveScore": 93,
        "workScore": 92,
        "healthScore": 90,
        "lovePrediction": "Slow and sensual energy surrounds your love life today. Take time to truly connect with your partner through touch, presence, and genuine appreciation. Quality time matters more than grand gestures right now.",
        "workPrediction": "Financial matters benefit from your careful and methodical review. A decision made with deliberation today protects and grows your resources beautifully.",
        "luckyNumbers": [
          16,
          82,
          89,
          92,
          94
        ],
        "luckyColor": "#546E7A"
      },
      "Gemini": {
        "date": "2026-02-21",
        "quote": "Brilliance is not your destination — it's your starting point.",
        "loveScore": 89,
        "workScore": 89,
        "healthScore": 71,
        "lovePrediction": "Communication is your love language and today it flows beautifully. Express what you've been holding back and watch the space between you and your loved one dissolve.",
        "workPrediction": "Networking opens a significant professional door today. Your natural conversational gift creates connections that develop into valuable opportunities over the coming weeks.",
        "luckyNumbers": [
          3,
          43,
          65,
          82,
          99
        ],
        "luckyColor": "#FFBF00"
      },
      "Cancer": {
        "date": "2026-02-21",
        "quote": "Nurturing others is your greatest gift to humanity.",
        "loveScore": 95,
        "workScore": 91,
        "healthScore": 74,
        "lovePrediction": "Your intuition leads you toward a meaningful romantic connection today. Trust the subtle feelings guiding your heart — they are far more reliable than logic in matters of love.",
        "workPrediction": "A long-term professional project you've been carefully tending is ready to bloom. Your patience and dedication have created something truly worth being proud of.",
        "luckyNumbers": [
          12,
          18,
          52,
          66,
          90
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-21",
        "quote": "Your confidence is not arrogance — it is your crown.",
        "loveScore": 73,
        "workScore": 79,
        "healthScore": 75,
        "lovePrediction": "Creative expression and romance intertwine beautifully today. Write a poem, sing a song, or simply speak your heart — your words of love are more powerful than you know.",
        "workPrediction": "Your ambitious goals receive a boost of momentum today as a key obstacle clears unexpectedly. Continue pushing forward with confidence — your dedication is about to be rewarded.",
        "luckyNumbers": [
          43,
          57,
          85,
          86,
          94
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-21",
        "quote": "In the details you find the beauty others overlook.",
        "loveScore": 86,
        "workScore": 72,
        "healthScore": 93,
        "lovePrediction": "Your acts of service speak the love your lips sometimes struggle to express today. A small, thoughtful gesture shows your partner more than any grand speech ever could.",
        "workPrediction": "A complex analytical task plays perfectly into your exceptional abilities today. The thoroughness of your work earns genuine admiration from those who understand what it took.",
        "luckyNumbers": [
          19,
          31,
          40,
          50,
          78
        ],
        "luckyColor": "#B8C4D8"
      },
      "Libra": {
        "date": "2026-02-21",
        "quote": "In your presence, peace becomes possible.",
        "loveScore": 91,
        "workScore": 75,
        "healthScore": 71,
        "lovePrediction": "For Librans seeking love, your natural magnetism is amplified today. Dress beautifully, smile genuinely, and trust that the universe is arranging a meaningful connection just for you.",
        "workPrediction": "An important professional relationship strengthens today through your sincere investment in mutual understanding. This connection will pay dividends in ways you can't yet fully predict.",
        "luckyNumbers": [
          34,
          55,
          60,
          77,
          82
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-21",
        "quote": "Your resilience is the stuff of legends.",
        "loveScore": 75,
        "workScore": 91,
        "healthScore": 94,
        "lovePrediction": "Your perceptive nature sees beneath the surface of your romantic connections today, reading what isn't being said with impressive accuracy. Use this wisdom with gentleness.",
        "workPrediction": "Research-intensive work flourishes under your exacting attention today. Your thoroughness uncovers insights that fundamentally improve your project and demonstrate your exceptional value.",
        "luckyNumbers": [
          28,
          32,
          38,
          50,
          70
        ],
        "luckyColor": "#800000"
      },
      "Sagittarius": {
        "date": "2026-02-21",
        "quote": "Your fire of enthusiasm ignites entire rooms of people.",
        "loveScore": 84,
        "workScore": 80,
        "healthScore": 77,
        "lovePrediction": "Your partner or romantic interest benefits from your uncanny ability to make them laugh and think at the same time. This combination of humor and depth is what makes you unforgettable.",
        "workPrediction": "Your optimism about a professional outcome proves well-founded as positive news arrives. Continue trusting your intuitive assessments — your gut reads the future accurately.",
        "luckyNumbers": [
          8,
          35,
          48,
          80,
          93
        ],
        "luckyColor": "#E040FB"
      },
      "Capricorn": {
        "date": "2026-02-21",
        "quote": "Every obstacle is data that makes your plan better.",
        "loveScore": 92,
        "workScore": 88,
        "healthScore": 85,
        "lovePrediction": "Love built on mutual respect and shared ambition deepens beautifully today. Your partner admires your dedication and feels inspired by your quiet strength. Show your appreciation in return.",
        "workPrediction": "A leadership opportunity materializes that aligns perfectly with your long-term career strategy. Step into it with the confidence of someone who has been preparing for exactly this.",
        "luckyNumbers": [
          6,
          40,
          41,
          74,
          93
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-21",
        "quote": "Question everything; improve everything; inspire everyone.",
        "loveScore": 92,
        "workScore": 84,
        "healthScore": 72,
        "lovePrediction": "A humanitarian cause or shared interest brings you into close proximity with someone whose passion matches your own. This kind of attraction, rooted in shared purpose, is the most lasting.",
        "workPrediction": "Your unconventional approach is exactly what breaks a professional logjam that has frustrated everyone else. Original thinking is the rarest and most valuable professional commodity.",
        "luckyNumbers": [
          26,
          50,
          51,
          78,
          99
        ],
        "luckyColor": "#9C27B0"
      },
      "Pisces": {
        "date": "2026-02-21",
        "quote": "Trust the current; you were born knowing how to swim.",
        "loveScore": 80,
        "workScore": 70,
        "healthScore": 92,
        "lovePrediction": "Love today feels like a dream you hope you never wake from. Your sensitivity allows you to experience romantic connection at a depth most people only read about in poetry.",
        "workPrediction": "A spiritual or philosophical dimension of your work deepens your professional purpose today. When your work aligns with your soul, the quality becomes transcendent.",
        "luckyNumbers": [
          5,
          33,
          35,
          69,
          74
        ],
        "luckyColor": "#9C27B0"
      }
    }
  },
  {
    "date": "2026-02-22",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-22",
        "quote": "The first step is the hardest — take it anyway.",
        "loveScore": 86,
        "workScore": 87,
        "healthScore": 93,
        "lovePrediction": "Sparks fly when you least expect them today. Your magnetic energy draws someone special closer, creating a connection that feels both exciting and refreshingly new. Allow yourself to be vulnerable — it's your strength, not your weakness.",
        "workPrediction": "A competitive situation plays beautifully into your strengths. Channel your natural drive into focused action and you'll secure the outcome you've been working toward.",
        "luckyNumbers": [
          33,
          60,
          62,
          66,
          87
        ],
        "luckyColor": "#8B0000"
      },
      "Taurus": {
        "date": "2026-02-22",
        "quote": "Comfort comes to those who create it with care.",
        "loveScore": 90,
        "workScore": 95,
        "healthScore": 90,
        "lovePrediction": "A romantic gesture doesn't need to be elaborate to be meaningful. Cook a meal, write a note, or simply sit quietly together — your love language speaks through care.",
        "workPrediction": "Your reliability earns you a significant opportunity at work. Someone in a position of influence has been quietly observing your consistency and is ready to reward it.",
        "luckyNumbers": [
          3,
          5,
          7,
          16,
          75
        ],
        "luckyColor": "#50C878"
      },
      "Gemini": {
        "date": "2026-02-22",
        "quote": "Your spark of genius ignites everything it touches.",
        "loveScore": 88,
        "workScore": 81,
        "healthScore": 83,
        "lovePrediction": "Your social energy attracts fascinating people today, and one connection feels particularly charged with romantic potential. Follow the thread of curiosity to see where it leads.",
        "workPrediction": "A writing, speaking, or communication-based project receives outstanding feedback. Your natural gift for words creates professional results that exceed expectations nicely.",
        "luckyNumbers": [
          5,
          8,
          16,
          39,
          63
        ],
        "luckyColor": "#FF9800"
      },
      "Cancer": {
        "date": "2026-02-22",
        "quote": "Home is wherever you bring your love.",
        "loveScore": 95,
        "workScore": 93,
        "healthScore": 87,
        "lovePrediction": "A romantic daydream from this morning may very well be reality by evening. Your feelings are magnetic today and they draw matching energy toward you effortlessly.",
        "workPrediction": "Your memory for people's preferences and history makes you exceptionally effective at client relationships today. This personal touch generates professional loyalty that translates into real success.",
        "luckyNumbers": [
          35,
          51,
          54,
          55,
          94
        ],
        "luckyColor": "#00BCD4"
      },
      "Leo": {
        "date": "2026-02-22",
        "quote": "Every room you enter becomes more alive with your presence.",
        "loveScore": 93,
        "workScore": 91,
        "healthScore": 87,
        "lovePrediction": "Your radiance is impossible to ignore today and romance is sparked by your generous, sun-bright energy. Someone is captivated by the way you light up every room you enter.",
        "workPrediction": "Your generosity with credit and praise motivates your team to remarkable heights. True leaders lift others up, and today you do this beautifully and effectively.",
        "luckyNumbers": [
          5,
          16,
          41,
          72,
          73
        ],
        "luckyColor": "#FF9800"
      },
      "Virgo": {
        "date": "2026-02-22",
        "quote": "Your practicality is the backbone of every great dream.",
        "loveScore": 75,
        "workScore": 82,
        "healthScore": 73,
        "lovePrediction": "A quiet evening of meaningful conversation reveals new layers in your relationship that thrill and deepen your connection. Your attention to detail makes your partner feel truly seen.",
        "workPrediction": "Your organizational skills bring order to a chaotic situation at work today, making the impossible feel manageable and earning you deep appreciation from your team.",
        "luckyNumbers": [
          17,
          25,
          42,
          60,
          90
        ],
        "luckyColor": "#00695C"
      },
      "Libra": {
        "date": "2026-02-22",
        "quote": "You are the architect of the harmony others dream of.",
        "loveScore": 86,
        "workScore": 89,
        "healthScore": 78,
        "lovePrediction": "Balance in giving and receiving love creates the perfect romantic rhythm today. Allow yourself to receive as graciously as you give — your partner loves to cherish you too.",
        "workPrediction": "Partnership opportunities in your career sector open up today. Your collaborative nature and professional reputation attract exactly the kind of partner who will amplify your success.",
        "luckyNumbers": [
          18,
          50,
          68,
          71,
          77
        ],
        "luckyColor": "#00BCD4"
      },
      "Scorpio": {
        "date": "2026-02-22",
        "quote": "Darkness holds no power over those who master it.",
        "loveScore": 91,
        "workScore": 92,
        "healthScore": 86,
        "lovePrediction": "Your seductive energy is operating at full power today, drawing the right kind of attention from the right kind of people. Be intentional about where you direct this magnetic force.",
        "workPrediction": "A career transformation begins in earnest today as you take the first concrete step toward the professional life you've been envisioning. Your determination will carry you all the way.",
        "luckyNumbers": [
          25,
          57,
          79,
          83,
          84
        ],
        "luckyColor": "#0F52BA"
      },
      "Sagittarius": {
        "date": "2026-02-22",
        "quote": "Shoot for the stars — your aim has always been true.",
        "loveScore": 72,
        "workScore": 83,
        "healthScore": 84,
        "lovePrediction": "Love feels like the greatest adventure today and you embrace it with your signature enthusiasm. A new romantic possibility excites both your heart and your wanderlust.",
        "workPrediction": "Your ability to see the big picture saves a project that got lost in the details today. Your strategic perspective realigns the team and restores momentum impressively.",
        "luckyNumbers": [
          23,
          35,
          38,
          59,
          72
        ],
        "luckyColor": "#9C27B0"
      },
      "Capricorn": {
        "date": "2026-02-22",
        "quote": "You build slowly, beautifully, and permanently.",
        "loveScore": 91,
        "workScore": 80,
        "healthScore": 89,
        "lovePrediction": "Vulnerability in love does not compromise your strength; it elevates it. Sharing your deeper feelings with a trusted partner today creates a bond that will last decades.",
        "workPrediction": "Your reputation for reliability brings an important new responsibility your way today. The trust placed in you reflects years of professional integrity and it opens significant doors.",
        "luckyNumbers": [
          22,
          50,
          56,
          59,
          95
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-22",
        "quote": "You were born to disrupt the ordinary with brilliance.",
        "loveScore": 76,
        "workScore": 95,
        "healthScore": 92,
        "lovePrediction": "Your authentic self is your most magnetic quality and today it shines brilliantly, attracting genuine admiration from someone who sees exactly who you are.",
        "workPrediction": "Your forward-thinking contributions to a team project are the element that transforms good into exceptional. The future belongs to visionaries and today you demonstrate exactly why.",
        "luckyNumbers": [
          33,
          35,
          51,
          63,
          79
        ],
        "luckyColor": "#40E0D0"
      },
      "Pisces": {
        "date": "2026-02-22",
        "quote": "Love expressed through you becomes something divine.",
        "loveScore": 84,
        "workScore": 83,
        "healthScore": 92,
        "lovePrediction": "Soft, poetic love is your specialty and today you express it with particular grace. Your partner feels wrapped in something luminous — which is exactly what love looks like through your eyes.",
        "workPrediction": "Your imaginative approach to a practical problem delights everyone involved today. The unexpected beauty and functionality of your solution is vintage Pisces genius.",
        "luckyNumbers": [
          8,
          10,
          40,
          54,
          60
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-23",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-23",
        "quote": "You were born to lead, not to follow.",
        "loveScore": 89,
        "workScore": 91,
        "healthScore": 87,
        "lovePrediction": "In existing relationships, passion surges and intimacy deepens when you lead with authentic expression. Plan something spontaneous and watch the magic unfold.",
        "workPrediction": "Your energy is infectious in the workplace today, motivating your team to match your ambitious pace. Recognition for your efforts arrives sooner than expected.",
        "luckyNumbers": [
          46,
          50,
          59,
          91,
          92
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-23",
        "quote": "Your endurance is poetry in motion.",
        "loveScore": 77,
        "workScore": 81,
        "healthScore": 73,
        "lovePrediction": "Sensuality is heightened today and physical affection brings you and your partner closer than words ever could. Let yourself enjoy the pleasure of simple, loving connection without overthinking it.",
        "workPrediction": "A financial negotiation or salary-related conversation goes in your favor. Your research and preparation demonstrate your serious commitment to your professional worth.",
        "luckyNumbers": [
          6,
          7,
          48,
          81,
          91
        ],
        "luckyColor": "#228B22"
      },
      "Gemini": {
        "date": "2026-02-23",
        "quote": "Your curiosity is the key that opens every locked door.",
        "loveScore": 81,
        "workScore": 94,
        "healthScore": 70,
        "lovePrediction": "Honesty in love creates the safety net that allows both of you to soar. Share something real today and receive the intimacy that only truth can create.",
        "workPrediction": "Your versatility shines today as you seamlessly move between very different types of tasks without losing effectiveness. This adaptability is a rare professional superpower.",
        "luckyNumbers": [
          11,
          50,
          63,
          69,
          98
        ],
        "luckyColor": "#00BCD4"
      },
      "Cancer": {
        "date": "2026-02-23",
        "quote": "Your intuition whispers truths that logic misses.",
        "loveScore": 84,
        "workScore": 92,
        "healthScore": 77,
        "lovePrediction": "Your emotional intuition is tuned perfectly today, allowing you to sense what your loved one needs before they speak it. This profound attunement deepens your bond in ways words never could.",
        "workPrediction": "Creative projects benefit from your intuitive approach today. Trust the hunches that guide your professional choices — your instincts have an impressive track record.",
        "luckyNumbers": [
          12,
          41,
          51,
          72,
          99
        ],
        "luckyColor": "#00BCD4"
      },
      "Leo": {
        "date": "2026-02-23",
        "quote": "Be the lion: majestic, brave, and deeply loyal.",
        "loveScore": 75,
        "workScore": 87,
        "healthScore": 83,
        "lovePrediction": "Your partner admires your confidence but craves your vulnerability too. Share your softer side today and watch your bond deepen to something truly magnificent.",
        "workPrediction": "Creative work receives outstanding recognition today. Your bold and original approach to a project stands out dramatically from the competition and earns well-deserved acclaim.",
        "luckyNumbers": [
          2,
          30,
          52,
          94,
          97
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-23",
        "quote": "Helping others heal is a superpower you use with grace.",
        "loveScore": 87,
        "workScore": 76,
        "healthScore": 76,
        "lovePrediction": "Your discerning heart recognizes quality when it sees it, and today you see it clearly. Trust your careful assessment of someone's character before investing your precious heart.",
        "workPrediction": "Helpful feedback you provide today creates a significant improvement in how your team operates. Your willingness to speak constructively is one of your most valuable professional gifts.",
        "luckyNumbers": [
          14,
          44,
          58,
          60,
          62
        ],
        "luckyColor": "#228B22"
      },
      "Libra": {
        "date": "2026-02-23",
        "quote": "Your ability to listen is the rarest form of intelligence.",
        "loveScore": 81,
        "workScore": 80,
        "healthScore": 87,
        "lovePrediction": "A decision about love becomes clearer today as your famous discernment cuts through confusion. Trust the verdict of your balanced heart — it always finds the fairest answer.",
        "workPrediction": "Your ability to present information fairly and persuasively makes today's professional meeting a success. Decision-makers trust your balanced assessment and act accordingly.",
        "luckyNumbers": [
          7,
          15,
          64,
          82,
          87
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-23",
        "quote": "You are the alchemist who turns pain into purpose.",
        "loveScore": 73,
        "workScore": 84,
        "healthScore": 73,
        "lovePrediction": "Intense and transformative energy surges through your love life today. A soul-deep connection either deepens magnificently or a necessary truth finally surfaces. Either way, you grow.",
        "workPrediction": "A power dynamic at work shifts in your favor today. Your quiet observation and patient timing deliver the professional result you've been strategically positioning yourself for.",
        "luckyNumbers": [
          10,
          11,
          69,
          96,
          98
        ],
        "luckyColor": "#DC143C"
      },
      "Sagittarius": {
        "date": "2026-02-23",
        "quote": "The seeker who never stops seeking always finds gold.",
        "loveScore": 81,
        "workScore": 83,
        "healthScore": 82,
        "lovePrediction": "Freedom and love are not opposites in your world — you prove today that the most liberating thing is being fully yourself with someone who celebrates exactly that.",
        "workPrediction": "An international or cross-cultural professional opportunity excites your expansive mind today. Your comfort with diverse perspectives makes you the ideal candidate for this kind of work.",
        "luckyNumbers": [
          4,
          13,
          39,
          69,
          88
        ],
        "luckyColor": "#00BCD4"
      },
      "Capricorn": {
        "date": "2026-02-23",
        "quote": "Success is not your reward — it's the natural result of you.",
        "loveScore": 71,
        "workScore": 74,
        "healthScore": 88,
        "lovePrediction": "Quality time over quantity is your love language today. A focused, device-free evening with your partner accomplishes more romantic progress than a month of rushed moments.",
        "workPrediction": "Your authority in your field is recognized today in a way that brings both professional and personal satisfaction. This validation confirms you are exactly where your effort was meant to take you.",
        "luckyNumbers": [
          15,
          47,
          51,
          63,
          76
        ],
        "luckyColor": "#228B22"
      },
      "Aquarius": {
        "date": "2026-02-23",
        "quote": "Your mind is a laboratory where impossibilities become solutions.",
        "loveScore": 90,
        "workScore": 84,
        "healthScore": 79,
        "lovePrediction": "Your visionary heart seeks a partner who dreams as boldly as you do, and today you get a glimpse of that perfect alignment. Trust that the universe is guiding this one perfectly.",
        "workPrediction": "A technology or systems improvement you've been advocating for finally gets implemented today. Your persistence in championing better ways of working creates lasting positive impact.",
        "luckyNumbers": [
          44,
          63,
          89,
          95,
          99
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-23",
        "quote": "Your imagination creates worlds others can only dream of.",
        "loveScore": 95,
        "workScore": 86,
        "healthScore": 82,
        "lovePrediction": "Your romantic imagination creates a love story so beautiful today that reality is moved to match it. Trust the dreams your heart sends you — they are not fantasies but blueprints.",
        "workPrediction": "Your compassionate approach to a workplace challenge creates a solution that heals as well as it solves. This is the unique professional gift that sets you apart from everyone else.",
        "luckyNumbers": [
          14,
          39,
          83,
          90,
          97
        ],
        "luckyColor": "#9C27B0"
      }
    }
  },
  {
    "date": "2026-02-24",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-24",
        "quote": "Passion fueled by purpose makes you unstoppable.",
        "loveScore": 87,
        "workScore": 78,
        "healthScore": 93,
        "lovePrediction": "Romance is heating up in your world today. Your natural charisma creates electric chemistry with someone who matches your fire. Trust your instincts about who deserves your heart.",
        "workPrediction": "A negotiation or presentation goes powerfully in your favor. Your directness and preparation combine for a result that advances your career in meaningful ways.",
        "luckyNumbers": [
          1,
          22,
          37,
          41,
          77
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-24",
        "quote": "Success tastes sweetest when savored slowly.",
        "loveScore": 76,
        "workScore": 76,
        "healthScore": 91,
        "lovePrediction": "An honest conversation about your needs and desires strengthens your partnership today. Vulnerability builds the kind of trust that makes love lasting and real.",
        "workPrediction": "Your methodical work style produces results that speak for themselves today. The quality and consistency of your output builds the professional reputation you deserve.",
        "luckyNumbers": [
          49,
          55,
          61,
          89,
          93
        ],
        "luckyColor": "#228B22"
      },
      "Gemini": {
        "date": "2026-02-24",
        "quote": "Two perspectives are better than one — and you have both.",
        "loveScore": 86,
        "workScore": 87,
        "healthScore": 84,
        "lovePrediction": "Witty banter and intellectual chemistry spark something wonderful in your love life today. A stimulating conversation with a potential partner reveals surprising depths of compatibility. Keep talking.",
        "workPrediction": "Multitasking efficiency reaches an impressive peak today. You handle several complex tasks simultaneously without losing quality, demonstrating the versatility that makes you indispensable.",
        "luckyNumbers": [
          12,
          28,
          46,
          64,
          93
        ],
        "luckyColor": "#40E0D0"
      },
      "Cancer": {
        "date": "2026-02-24",
        "quote": "Vulnerability is the birthplace of real connection.",
        "loveScore": 93,
        "workScore": 72,
        "healthScore": 87,
        "lovePrediction": "Emotional conversations held today have the power to heal old wounds and create new levels of intimacy. Allow yourself to be both the one who comforts and the one who is comforted.",
        "workPrediction": "Your natural caregiving energy makes you an exceptional team member today. Colleagues feel supported and motivated, which reflects beautifully in the collective output.",
        "luckyNumbers": [
          1,
          26,
          58,
          72,
          77
        ],
        "luckyColor": "#E6E6FA"
      },
      "Leo": {
        "date": "2026-02-24",
        "quote": "Your greatness inspires others to discover their own.",
        "loveScore": 75,
        "workScore": 84,
        "healthScore": 72,
        "lovePrediction": "Romance is theatrical and thrilling today in the very best way. Lean into the drama of love — plan something memorable that shows your partner how much you cherish them.",
        "workPrediction": "Mentoring someone at work brings you the deepest professional satisfaction today. Your natural generosity of spirit creates an impact on this person that extends far beyond the workday.",
        "luckyNumbers": [
          3,
          7,
          24,
          40,
          88
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-24",
        "quote": "Order in your world creates peace in those around you.",
        "loveScore": 77,
        "workScore": 80,
        "healthScore": 87,
        "lovePrediction": "Romance is in the practical details today — a perfectly timed cup of tea, a remembered appointment, a worry addressed before it was spoken. These are your love letters.",
        "workPrediction": "Your systematic approach to a new challenge produces a plan so thorough that your superiors immediately trust you to implement it independently. Confidence well placed in you.",
        "luckyNumbers": [
          7,
          9,
          11,
          16,
          83
        ],
        "luckyColor": "#546E7A"
      },
      "Libra": {
        "date": "2026-02-24",
        "quote": "Every act of fairness you perform shifts the world's balance.",
        "loveScore": 92,
        "workScore": 90,
        "healthScore": 81,
        "lovePrediction": "Harmony and romance dance together beautifully in your life today. Your natural grace creates an environment where love feels safe, beautiful, and deeply fulfilling.",
        "workPrediction": "A collaborative project thrives under your facilitative leadership today. Your ability to bring out the best in everyone around you creates results greater than any individual could achieve.",
        "luckyNumbers": [
          35,
          70,
          80,
          86,
          89
        ],
        "luckyColor": "#00BCD4"
      },
      "Scorpio": {
        "date": "2026-02-24",
        "quote": "Intensity in love creates bonds nothing can break.",
        "loveScore": 74,
        "workScore": 95,
        "healthScore": 76,
        "lovePrediction": "Emotional honesty, though challenging for your privacy-loving soul, creates the kind of intimacy you crave most. Take the risk of being seen completely — it's worth it.",
        "workPrediction": "Your intensity and focus allow you to accomplish in one day what others would spread over a week. This level of concentrated effort does not go unnoticed by those who matter.",
        "luckyNumbers": [
          26,
          27,
          80,
          81,
          90
        ],
        "luckyColor": "#546E7A"
      },
      "Sagittarius": {
        "date": "2026-02-24",
        "quote": "Your love of freedom makes you free in every sense.",
        "loveScore": 75,
        "workScore": 75,
        "healthScore": 95,
        "lovePrediction": "Your honesty, even when blunt, is the most attractive thing about you and someone in your world appreciates it profoundly today. Authenticity is your greatest romantic asset.",
        "workPrediction": "Educational or publishing opportunities in your professional sphere open up today. Your natural wisdom and communication skills position you perfectly to share what you know with a wider audience.",
        "luckyNumbers": [
          17,
          22,
          31,
          46,
          62
        ],
        "luckyColor": "#40E0D0"
      },
      "Capricorn": {
        "date": "2026-02-24",
        "quote": "Your work ethic is both your compass and your engine.",
        "loveScore": 79,
        "workScore": 85,
        "healthScore": 71,
        "lovePrediction": "Commitment feels like a reward rather than a burden in your relationship today. Reaffirm your dedication and watch your partner's eyes light up with the certainty of being chosen.",
        "workPrediction": "A mentor or senior professional takes meaningful interest in your career today. The guidance they offer is gold — receive it with the humility and gratitude it deserves.",
        "luckyNumbers": [
          12,
          16,
          68,
          70,
          84
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-24",
        "quote": "Evolution needs visionaries — and you answer the call.",
        "loveScore": 95,
        "workScore": 91,
        "healthScore": 88,
        "lovePrediction": "Intellectual attraction is the most powerful force in your romantic world today. A meeting of brilliant minds creates the kind of spark that doesn't easily fade.",
        "workPrediction": "Collaboration on a technology-forward or socially impactful project brings you both professional satisfaction and meaningful results. This is the kind of work your brilliant mind was made for.",
        "luckyNumbers": [
          5,
          27,
          33,
          80,
          87
        ],
        "luckyColor": "#0F52BA"
      },
      "Pisces": {
        "date": "2026-02-24",
        "quote": "Compassion without limits is your most divine quality.",
        "loveScore": 94,
        "workScore": 74,
        "healthScore": 71,
        "lovePrediction": "A spiritual or creative connection with someone new feels both familiar and thrillingly unknown. Your soul recognizes this meeting — trust the sacred feeling and follow its thread.",
        "workPrediction": "Imaginative work flourishes under your inspired guidance today. The solutions you generate feel almost magical to your more analytical colleagues, yet they are powerfully effective.",
        "luckyNumbers": [
          1,
          12,
          58,
          72,
          99
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-25",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-25",
        "quote": "Your ambition is your greatest superpower.",
        "loveScore": 85,
        "workScore": 82,
        "healthScore": 92,
        "lovePrediction": "Passion and tenderness combine beautifully in your romantic life today. Express appreciation openly and watch your relationships flourish with warmth and renewed connection.",
        "workPrediction": "Leadership opportunities surface and you step into them naturally. Your colleagues benefit enormously from your decisive guidance and high energy today.",
        "luckyNumbers": [
          5,
          17,
          32,
          66,
          93
        ],
        "luckyColor": "#FF9800"
      },
      "Taurus": {
        "date": "2026-02-25",
        "quote": "You are the rock upon which great things are built.",
        "loveScore": 74,
        "workScore": 82,
        "healthScore": 92,
        "lovePrediction": "Slow and sensual energy surrounds your love life today. Take time to truly connect with your partner through touch, presence, and genuine appreciation. Quality time matters more than grand gestures right now.",
        "workPrediction": "Financial matters benefit from your careful and methodical review. A decision made with deliberation today protects and grows your resources beautifully.",
        "luckyNumbers": [
          27,
          61,
          64,
          77,
          97
        ],
        "luckyColor": "#F48FB1"
      },
      "Gemini": {
        "date": "2026-02-25",
        "quote": "Adaptability is your superpower in a changing world.",
        "loveScore": 79,
        "workScore": 78,
        "healthScore": 86,
        "lovePrediction": "Communication is your love language and today it flows beautifully. Express what you've been holding back and watch the space between you and your loved one dissolve.",
        "workPrediction": "Networking opens a significant professional door today. Your natural conversational gift creates connections that develop into valuable opportunities over the coming weeks.",
        "luckyNumbers": [
          13,
          20,
          25,
          95,
          97
        ],
        "luckyColor": "#FFBF00"
      },
      "Cancer": {
        "date": "2026-02-25",
        "quote": "Love fiercely — the world needs more of your tenderness.",
        "loveScore": 81,
        "workScore": 77,
        "healthScore": 91,
        "lovePrediction": "Your intuition leads you toward a meaningful romantic connection today. Trust the subtle feelings guiding your heart — they are far more reliable than logic in matters of love.",
        "workPrediction": "A long-term professional project you've been carefully tending is ready to bloom. Your patience and dedication have created something truly worth being proud of.",
        "luckyNumbers": [
          6,
          24,
          67,
          69,
          81
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-25",
        "quote": "Wear your passion like a robe of gold.",
        "loveScore": 77,
        "workScore": 92,
        "healthScore": 78,
        "lovePrediction": "Creative expression and romance intertwine beautifully today. Write a poem, sing a song, or simply speak your heart — your words of love are more powerful than you know.",
        "workPrediction": "Your ambitious goals receive a boost of momentum today as a key obstacle clears unexpectedly. Continue pushing forward with confidence — your dedication is about to be rewarded.",
        "luckyNumbers": [
          8,
          53,
          66,
          72,
          90
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-25",
        "quote": "Your criticism is love in disguise — keep sharing it.",
        "loveScore": 91,
        "workScore": 94,
        "healthScore": 77,
        "lovePrediction": "Your acts of service speak the love your lips sometimes struggle to express today. A small, thoughtful gesture shows your partner more than any grand speech ever could.",
        "workPrediction": "A complex analytical task plays perfectly into your exceptional abilities today. The thoroughness of your work earns genuine admiration from those who understand what it took.",
        "luckyNumbers": [
          3,
          15,
          68,
          72,
          80
        ],
        "luckyColor": "#228B22"
      },
      "Libra": {
        "date": "2026-02-25",
        "quote": "Elegance and equity — you embody both with ease.",
        "loveScore": 81,
        "workScore": 90,
        "healthScore": 95,
        "lovePrediction": "For Librans seeking love, your natural magnetism is amplified today. Dress beautifully, smile genuinely, and trust that the universe is arranging a meaningful connection just for you.",
        "workPrediction": "An important professional relationship strengthens today through your sincere investment in mutual understanding. This connection will pay dividends in ways you can't yet fully predict.",
        "luckyNumbers": [
          27,
          52,
          69,
          83,
          90
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-25",
        "quote": "Your courage to face truth sets everyone around you free.",
        "loveScore": 88,
        "workScore": 70,
        "healthScore": 74,
        "lovePrediction": "Your perceptive nature sees beneath the surface of your romantic connections today, reading what isn't being said with impressive accuracy. Use this wisdom with gentleness.",
        "workPrediction": "Research-intensive work flourishes under your exacting attention today. Your thoroughness uncovers insights that fundamentally improve your project and demonstrate your exceptional value.",
        "luckyNumbers": [
          49,
          60,
          73,
          88,
          98
        ],
        "luckyColor": "#8B0000"
      },
      "Sagittarius": {
        "date": "2026-02-25",
        "quote": "Adventure awaits at the edge of every comfort zone.",
        "loveScore": 74,
        "workScore": 91,
        "healthScore": 76,
        "lovePrediction": "Your partner or romantic interest benefits from your uncanny ability to make them laugh and think at the same time. This combination of humor and depth is what makes you unforgettable.",
        "workPrediction": "Your optimism about a professional outcome proves well-founded as positive news arrives. Continue trusting your intuitive assessments — your gut reads the future accurately.",
        "luckyNumbers": [
          6,
          27,
          35,
          47,
          78
        ],
        "luckyColor": "#0F52BA"
      },
      "Capricorn": {
        "date": "2026-02-25",
        "quote": "Tenacity dressed in professionalism is your signature.",
        "loveScore": 94,
        "workScore": 74,
        "healthScore": 79,
        "lovePrediction": "Love built on mutual respect and shared ambition deepens beautifully today. Your partner admires your dedication and feels inspired by your quiet strength. Show your appreciation in return.",
        "workPrediction": "A leadership opportunity materializes that aligns perfectly with your long-term career strategy. Step into it with the confidence of someone who has been preparing for exactly this.",
        "luckyNumbers": [
          3,
          52,
          74,
          81,
          93
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-25",
        "quote": "You belong to the future even while living in the present.",
        "loveScore": 73,
        "workScore": 75,
        "healthScore": 88,
        "lovePrediction": "A humanitarian cause or shared interest brings you into close proximity with someone whose passion matches your own. This kind of attraction, rooted in shared purpose, is the most lasting.",
        "workPrediction": "Your unconventional approach is exactly what breaks a professional logjam that has frustrated everyone else. Original thinking is the rarest and most valuable professional commodity.",
        "luckyNumbers": [
          3,
          39,
          59,
          81,
          96
        ],
        "luckyColor": "#0F52BA"
      },
      "Pisces": {
        "date": "2026-02-25",
        "quote": "The ocean of your creativity has no visible shore.",
        "loveScore": 85,
        "workScore": 89,
        "healthScore": 81,
        "lovePrediction": "Love today feels like a dream you hope you never wake from. Your sensitivity allows you to experience romantic connection at a depth most people only read about in poetry.",
        "workPrediction": "A spiritual or philosophical dimension of your work deepens your professional purpose today. When your work aligns with your soul, the quality becomes transcendent.",
        "luckyNumbers": [
          30,
          38,
          39,
          47,
          96
        ],
        "luckyColor": "#B8C4D8"
      }
    }
  },
  {
    "date": "2026-02-26",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-26",
        "quote": "Chase your dreams with the speed of a shooting star.",
        "loveScore": 74,
        "workScore": 90,
        "healthScore": 81,
        "lovePrediction": "Sparks fly when you least expect them today. Your magnetic energy draws someone special closer, creating a connection that feels both exciting and refreshingly new. Allow yourself to be vulnerable — it's your strength, not your weakness.",
        "workPrediction": "A competitive situation plays beautifully into your strengths. Channel your natural drive into focused action and you'll secure the outcome you've been working toward.",
        "luckyNumbers": [
          4,
          39,
          44,
          50,
          56
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-26",
        "quote": "Patience planted today blooms into abundance tomorrow.",
        "loveScore": 84,
        "workScore": 80,
        "healthScore": 86,
        "lovePrediction": "A romantic gesture doesn't need to be elaborate to be meaningful. Cook a meal, write a note, or simply sit quietly together — your love language speaks through care.",
        "workPrediction": "Your reliability earns you a significant opportunity at work. Someone in a position of influence has been quietly observing your consistency and is ready to reward it.",
        "luckyNumbers": [
          3,
          35,
          72,
          84,
          93
        ],
        "luckyColor": "#F48FB1"
      },
      "Gemini": {
        "date": "2026-02-26",
        "quote": "Wit and wisdom dance together in your brilliant mind.",
        "loveScore": 74,
        "workScore": 91,
        "healthScore": 91,
        "lovePrediction": "Your social energy attracts fascinating people today, and one connection feels particularly charged with romantic potential. Follow the thread of curiosity to see where it leads.",
        "workPrediction": "A writing, speaking, or communication-based project receives outstanding feedback. Your natural gift for words creates professional results that exceed expectations nicely.",
        "luckyNumbers": [
          25,
          38,
          53,
          98,
          99
        ],
        "luckyColor": "#FF7F50"
      },
      "Cancer": {
        "date": "2026-02-26",
        "quote": "Your emotional depth is your most powerful compass.",
        "loveScore": 78,
        "workScore": 87,
        "healthScore": 73,
        "lovePrediction": "A romantic daydream from this morning may very well be reality by evening. Your feelings are magnetic today and they draw matching energy toward you effortlessly.",
        "workPrediction": "Your memory for people's preferences and history makes you exceptionally effective at client relationships today. This personal touch generates professional loyalty that translates into real success.",
        "luckyNumbers": [
          11,
          65,
          73,
          74,
          77
        ],
        "luckyColor": "#40E0D0"
      },
      "Leo": {
        "date": "2026-02-26",
        "quote": "The heart of a lion beats with purpose in your chest.",
        "loveScore": 84,
        "workScore": 91,
        "healthScore": 71,
        "lovePrediction": "Your radiance is impossible to ignore today and romance is sparked by your generous, sun-bright energy. Someone is captivated by the way you light up every room you enter.",
        "workPrediction": "Your generosity with credit and praise motivates your team to remarkable heights. True leaders lift others up, and today you do this beautifully and effectively.",
        "luckyNumbers": [
          21,
          55,
          75,
          94,
          95
        ],
        "luckyColor": "#C9A84C"
      },
      "Virgo": {
        "date": "2026-02-26",
        "quote": "The world runs smoother because you pay attention.",
        "loveScore": 80,
        "workScore": 83,
        "healthScore": 86,
        "lovePrediction": "A quiet evening of meaningful conversation reveals new layers in your relationship that thrill and deepen your connection. Your attention to detail makes your partner feel truly seen.",
        "workPrediction": "Your organizational skills bring order to a chaotic situation at work today, making the impossible feel manageable and earning you deep appreciation from your team.",
        "luckyNumbers": [
          36,
          59,
          65,
          68,
          70
        ],
        "luckyColor": "#0F52BA"
      },
      "Libra": {
        "date": "2026-02-26",
        "quote": "You bring light to the gray areas of life.",
        "loveScore": 82,
        "workScore": 81,
        "healthScore": 70,
        "lovePrediction": "Balance in giving and receiving love creates the perfect romantic rhythm today. Allow yourself to receive as graciously as you give — your partner loves to cherish you too.",
        "workPrediction": "Partnership opportunities in your career sector open up today. Your collaborative nature and professional reputation attract exactly the kind of partner who will amplify your success.",
        "luckyNumbers": [
          22,
          34,
          71,
          74,
          76
        ],
        "luckyColor": "#E6E6FA"
      },
      "Scorpio": {
        "date": "2026-02-26",
        "quote": "Secrets are safe with you — and so are people's hearts.",
        "loveScore": 95,
        "workScore": 81,
        "healthScore": 95,
        "lovePrediction": "Your seductive energy is operating at full power today, drawing the right kind of attention from the right kind of people. Be intentional about where you direct this magnetic force.",
        "workPrediction": "A career transformation begins in earnest today as you take the first concrete step toward the professional life you've been envisioning. Your determination will carry you all the way.",
        "luckyNumbers": [
          21,
          41,
          42,
          69,
          90
        ],
        "luckyColor": "#9C27B0"
      },
      "Sagittarius": {
        "date": "2026-02-26",
        "quote": "Your wisdom grows with every mile you travel.",
        "loveScore": 94,
        "workScore": 86,
        "healthScore": 73,
        "lovePrediction": "Love feels like the greatest adventure today and you embrace it with your signature enthusiasm. A new romantic possibility excites both your heart and your wanderlust.",
        "workPrediction": "Your ability to see the big picture saves a project that got lost in the details today. Your strategic perspective realigns the team and restores momentum impressively.",
        "luckyNumbers": [
          1,
          11,
          28,
          64,
          94
        ],
        "luckyColor": "#9C27B0"
      },
      "Capricorn": {
        "date": "2026-02-26",
        "quote": "You make the impossible look like a reasonable Tuesday.",
        "loveScore": 83,
        "workScore": 87,
        "healthScore": 94,
        "lovePrediction": "Vulnerability in love does not compromise your strength; it elevates it. Sharing your deeper feelings with a trusted partner today creates a bond that will last decades.",
        "workPrediction": "Your reputation for reliability brings an important new responsibility your way today. The trust placed in you reflects years of professional integrity and it opens significant doors.",
        "luckyNumbers": [
          16,
          17,
          81,
          93,
          96
        ],
        "luckyColor": "#0F52BA"
      },
      "Aquarius": {
        "date": "2026-02-26",
        "quote": "You don't follow the future — you create it.",
        "loveScore": 95,
        "workScore": 79,
        "healthScore": 71,
        "lovePrediction": "Your authentic self is your most magnetic quality and today it shines brilliantly, attracting genuine admiration from someone who sees exactly who you are.",
        "workPrediction": "Your forward-thinking contributions to a team project are the element that transforms good into exceptional. The future belongs to visionaries and today you demonstrate exactly why.",
        "luckyNumbers": [
          6,
          38,
          43,
          86,
          97
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-26",
        "quote": "You feel deeply because you love deeply — never change.",
        "loveScore": 72,
        "workScore": 87,
        "healthScore": 74,
        "lovePrediction": "Soft, poetic love is your specialty and today you express it with particular grace. Your partner feels wrapped in something luminous — which is exactly what love looks like through your eyes.",
        "workPrediction": "Your imaginative approach to a practical problem delights everyone involved today. The unexpected beauty and functionality of your solution is vintage Pisces genius.",
        "luckyNumbers": [
          42,
          67,
          81,
          86,
          98
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-27",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-27",
        "quote": "Be the force of nature you were always meant to be.",
        "loveScore": 94,
        "workScore": 74,
        "healthScore": 89,
        "lovePrediction": "In existing relationships, passion surges and intimacy deepens when you lead with authentic expression. Plan something spontaneous and watch the magic unfold.",
        "workPrediction": "Your energy is infectious in the workplace today, motivating your team to match your ambitious pace. Recognition for your efforts arrives sooner than expected.",
        "luckyNumbers": [
          4,
          24,
          27,
          49,
          83
        ],
        "luckyColor": "#DC143C"
      },
      "Taurus": {
        "date": "2026-02-27",
        "quote": "Your steadiness is the foundation others build upon.",
        "loveScore": 80,
        "workScore": 75,
        "healthScore": 81,
        "lovePrediction": "Sensuality is heightened today and physical affection brings you and your partner closer than words ever could. Let yourself enjoy the pleasure of simple, loving connection without overthinking it.",
        "workPrediction": "A financial negotiation or salary-related conversation goes in your favor. Your research and preparation demonstrate your serious commitment to your professional worth.",
        "luckyNumbers": [
          33,
          44,
          49,
          56,
          82
        ],
        "luckyColor": "#C9A84C"
      },
      "Gemini": {
        "date": "2026-02-27",
        "quote": "Every conversation you have plants seeds of inspiration.",
        "loveScore": 81,
        "workScore": 79,
        "healthScore": 71,
        "lovePrediction": "Honesty in love creates the safety net that allows both of you to soar. Share something real today and receive the intimacy that only truth can create.",
        "workPrediction": "Your versatility shines today as you seamlessly move between very different types of tasks without losing effectiveness. This adaptability is a rare professional superpower.",
        "luckyNumbers": [
          24,
          66,
          68,
          72,
          95
        ],
        "luckyColor": "#40E0D0"
      },
      "Cancer": {
        "date": "2026-02-27",
        "quote": "In caring for others you discover your truest self.",
        "loveScore": 84,
        "workScore": 72,
        "healthScore": 76,
        "lovePrediction": "Your emotional intuition is tuned perfectly today, allowing you to sense what your loved one needs before they speak it. This profound attunement deepens your bond in ways words never could.",
        "workPrediction": "Creative projects benefit from your intuitive approach today. Trust the hunches that guide your professional choices — your instincts have an impressive track record.",
        "luckyNumbers": [
          36,
          41,
          56,
          81,
          96
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-27",
        "quote": "Shine not to outshine others but to show them it's possible.",
        "loveScore": 77,
        "workScore": 74,
        "healthScore": 72,
        "lovePrediction": "Your partner admires your confidence but craves your vulnerability too. Share your softer side today and watch your bond deepen to something truly magnificent.",
        "workPrediction": "Creative work receives outstanding recognition today. Your bold and original approach to a project stands out dramatically from the competition and earns well-deserved acclaim.",
        "luckyNumbers": [
          28,
          30,
          46,
          63,
          70
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-27",
        "quote": "Humility is your silent strength and loudest virtue.",
        "loveScore": 92,
        "workScore": 81,
        "healthScore": 80,
        "lovePrediction": "Your discerning heart recognizes quality when it sees it, and today you see it clearly. Trust your careful assessment of someone's character before investing your precious heart.",
        "workPrediction": "Helpful feedback you provide today creates a significant improvement in how your team operates. Your willingness to speak constructively is one of your most valuable professional gifts.",
        "luckyNumbers": [
          30,
          84,
          86,
          95,
          96
        ],
        "luckyColor": "#546E7A"
      },
      "Libra": {
        "date": "2026-02-27",
        "quote": "Your partnerships thrive because you invest in them fully.",
        "loveScore": 70,
        "workScore": 78,
        "healthScore": 71,
        "lovePrediction": "A decision about love becomes clearer today as your famous discernment cuts through confusion. Trust the verdict of your balanced heart — it always finds the fairest answer.",
        "workPrediction": "Your ability to present information fairly and persuasively makes today's professional meeting a success. Decision-makers trust your balanced assessment and act accordingly.",
        "luckyNumbers": [
          4,
          7,
          35,
          58,
          97
        ],
        "luckyColor": "#E6E6FA"
      },
      "Scorpio": {
        "date": "2026-02-27",
        "quote": "Dive deep; your greatest treasures are found below.",
        "loveScore": 72,
        "workScore": 86,
        "healthScore": 83,
        "lovePrediction": "Intense and transformative energy surges through your love life today. A soul-deep connection either deepens magnificently or a necessary truth finally surfaces. Either way, you grow.",
        "workPrediction": "A power dynamic at work shifts in your favor today. Your quiet observation and patient timing deliver the professional result you've been strategically positioning yourself for.",
        "luckyNumbers": [
          5,
          20,
          63,
          68,
          79
        ],
        "luckyColor": "#546E7A"
      },
      "Sagittarius": {
        "date": "2026-02-27",
        "quote": "Philosophy and humor together make you unforgettable.",
        "loveScore": 81,
        "workScore": 89,
        "healthScore": 82,
        "lovePrediction": "Freedom and love are not opposites in your world — you prove today that the most liberating thing is being fully yourself with someone who celebrates exactly that.",
        "workPrediction": "An international or cross-cultural professional opportunity excites your expansive mind today. Your comfort with diverse perspectives makes you the ideal candidate for this kind of work.",
        "luckyNumbers": [
          21,
          34,
          48,
          52,
          75
        ],
        "luckyColor": "#4B0082"
      },
      "Capricorn": {
        "date": "2026-02-27",
        "quote": "Climb with purpose; rest with intention; rise with grace.",
        "loveScore": 89,
        "workScore": 80,
        "healthScore": 75,
        "lovePrediction": "Quality time over quantity is your love language today. A focused, device-free evening with your partner accomplishes more romantic progress than a month of rushed moments.",
        "workPrediction": "Your authority in your field is recognized today in a way that brings both professional and personal satisfaction. This validation confirms you are exactly where your effort was meant to take you.",
        "luckyNumbers": [
          8,
          25,
          26,
          79,
          91
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-27",
        "quote": "Your vision sees solutions where others see only problems.",
        "loveScore": 87,
        "workScore": 79,
        "healthScore": 92,
        "lovePrediction": "Your visionary heart seeks a partner who dreams as boldly as you do, and today you get a glimpse of that perfect alignment. Trust that the universe is guiding this one perfectly.",
        "workPrediction": "A technology or systems improvement you've been advocating for finally gets implemented today. Your persistence in championing better ways of working creates lasting positive impact.",
        "luckyNumbers": [
          27,
          32,
          40,
          41,
          70
        ],
        "luckyColor": "#00BCD4"
      },
      "Pisces": {
        "date": "2026-02-27",
        "quote": "Your dreams are not escapes; they are your greatest truths.",
        "loveScore": 94,
        "workScore": 82,
        "healthScore": 71,
        "lovePrediction": "Your romantic imagination creates a love story so beautiful today that reality is moved to match it. Trust the dreams your heart sends you — they are not fantasies but blueprints.",
        "workPrediction": "Your compassionate approach to a workplace challenge creates a solution that heals as well as it solves. This is the unique professional gift that sets you apart from everyone else.",
        "luckyNumbers": [
          3,
          41,
          46,
          78,
          82
        ],
        "luckyColor": "#00BCD4"
      }
    }
  },
  {
    "date": "2026-02-28",
    "horoscopes": {
      "Aries": {
        "date": "2026-02-28",
        "quote": "Every sunrise is your invitation to conquer.",
        "loveScore": 92,
        "workScore": 79,
        "healthScore": 91,
        "lovePrediction": "Romance is heating up in your world today. Your natural charisma creates electric chemistry with someone who matches your fire. Trust your instincts about who deserves your heart.",
        "workPrediction": "A negotiation or presentation goes powerfully in your favor. Your directness and preparation combine for a result that advances your career in meaningful ways.",
        "luckyNumbers": [
          33,
          70,
          72,
          73,
          79
        ],
        "luckyColor": "#FF9800"
      },
      "Taurus": {
        "date": "2026-02-28",
        "quote": "Slow and deliberate wins the race every time.",
        "loveScore": 94,
        "workScore": 74,
        "healthScore": 86,
        "lovePrediction": "An honest conversation about your needs and desires strengthens your partnership today. Vulnerability builds the kind of trust that makes love lasting and real.",
        "workPrediction": "Your methodical work style produces results that speak for themselves today. The quality and consistency of your output builds the professional reputation you deserve.",
        "luckyNumbers": [
          13,
          48,
          64,
          76,
          92
        ],
        "luckyColor": "#546E7A"
      },
      "Gemini": {
        "date": "2026-02-28",
        "quote": "Your versatility makes the impossible feel effortless.",
        "loveScore": 92,
        "workScore": 81,
        "healthScore": 75,
        "lovePrediction": "Witty banter and intellectual chemistry spark something wonderful in your love life today. A stimulating conversation with a potential partner reveals surprising depths of compatibility. Keep talking.",
        "workPrediction": "Multitasking efficiency reaches an impressive peak today. You handle several complex tasks simultaneously without losing quality, demonstrating the versatility that makes you indispensable.",
        "luckyNumbers": [
          2,
          25,
          56,
          75,
          86
        ],
        "luckyColor": "#FFBF00"
      },
      "Cancer": {
        "date": "2026-02-28",
        "quote": "The tides of life always bring you back to shore.",
        "loveScore": 76,
        "workScore": 83,
        "healthScore": 75,
        "lovePrediction": "Emotional conversations held today have the power to heal old wounds and create new levels of intimacy. Allow yourself to be both the one who comforts and the one who is comforted.",
        "workPrediction": "Your natural caregiving energy makes you an exceptional team member today. Colleagues feel supported and motivated, which reflects beautifully in the collective output.",
        "luckyNumbers": [
          2,
          8,
          73,
          88,
          98
        ],
        "luckyColor": "#B8C4D8"
      },
      "Leo": {
        "date": "2026-02-28",
        "quote": "You are the sun — life gravitates toward your warmth.",
        "loveScore": 79,
        "workScore": 74,
        "healthScore": 78,
        "lovePrediction": "Romance is theatrical and thrilling today in the very best way. Lean into the drama of love — plan something memorable that shows your partner how much you cherish them.",
        "workPrediction": "Mentoring someone at work brings you the deepest professional satisfaction today. Your natural generosity of spirit creates an impact on this person that extends far beyond the workday.",
        "luckyNumbers": [
          20,
          44,
          81,
          85,
          88
        ],
        "luckyColor": "#FFBF00"
      },
      "Virgo": {
        "date": "2026-02-28",
        "quote": "You transform chaos into clarity with elegant precision.",
        "loveScore": 88,
        "workScore": 80,
        "healthScore": 70,
        "lovePrediction": "Romance is in the practical details today — a perfectly timed cup of tea, a remembered appointment, a worry addressed before it was spoken. These are your love letters.",
        "workPrediction": "Your systematic approach to a new challenge produces a plan so thorough that your superiors immediately trust you to implement it independently. Confidence well placed in you.",
        "luckyNumbers": [
          13,
          65,
          78,
          84,
          91
        ],
        "luckyColor": "#B8C4D8"
      },
      "Libra": {
        "date": "2026-02-28",
        "quote": "Kindness given strategically is your highest diplomacy.",
        "loveScore": 81,
        "workScore": 72,
        "healthScore": 80,
        "lovePrediction": "Harmony and romance dance together beautifully in your life today. Your natural grace creates an environment where love feels safe, beautiful, and deeply fulfilling.",
        "workPrediction": "A collaborative project thrives under your facilitative leadership today. Your ability to bring out the best in everyone around you creates results greater than any individual could achieve.",
        "luckyNumbers": [
          22,
          32,
          48,
          69,
          96
        ],
        "luckyColor": "#F48FB1"
      },
      "Scorpio": {
        "date": "2026-02-28",
        "quote": "Obsession channeled into purpose creates miracles.",
        "loveScore": 84,
        "workScore": 86,
        "healthScore": 81,
        "lovePrediction": "Emotional honesty, though challenging for your privacy-loving soul, creates the kind of intimacy you crave most. Take the risk of being seen completely — it's worth it.",
        "workPrediction": "Your intensity and focus allow you to accomplish in one day what others would spread over a week. This level of concentrated effort does not go unnoticed by those who matter.",
        "luckyNumbers": [
          36,
          52,
          71,
          73,
          98
        ],
        "luckyColor": "#800000"
      },
      "Sagittarius": {
        "date": "2026-02-28",
        "quote": "You are proof that joy is a philosophy, not just a feeling.",
        "loveScore": 93,
        "workScore": 86,
        "healthScore": 74,
        "lovePrediction": "Your honesty, even when blunt, is the most attractive thing about you and someone in your world appreciates it profoundly today. Authenticity is your greatest romantic asset.",
        "workPrediction": "Educational or publishing opportunities in your professional sphere open up today. Your natural wisdom and communication skills position you perfectly to share what you know with a wider audience.",
        "luckyNumbers": [
          5,
          10,
          20,
          27,
          40
        ],
        "luckyColor": "#E040FB"
      },
      "Capricorn": {
        "date": "2026-02-28",
        "quote": "Your legacy is being written in every disciplined choice.",
        "loveScore": 79,
        "workScore": 94,
        "healthScore": 78,
        "lovePrediction": "Commitment feels like a reward rather than a burden in your relationship today. Reaffirm your dedication and watch your partner's eyes light up with the certainty of being chosen.",
        "workPrediction": "A mentor or senior professional takes meaningful interest in your career today. The guidance they offer is gold — receive it with the humility and gratitude it deserves.",
        "luckyNumbers": [
          6,
          41,
          58,
          85,
          87
        ],
        "luckyColor": "#546E7A"
      },
      "Aquarius": {
        "date": "2026-02-28",
        "quote": "Innovation is not your hobby; it's your reason for being.",
        "loveScore": 71,
        "workScore": 91,
        "healthScore": 76,
        "lovePrediction": "Intellectual attraction is the most powerful force in your romantic world today. A meeting of brilliant minds creates the kind of spark that doesn't easily fade.",
        "workPrediction": "Collaboration on a technology-forward or socially impactful project brings you both professional satisfaction and meaningful results. This is the kind of work your brilliant mind was made for.",
        "luckyNumbers": [
          10,
          12,
          30,
          35,
          45
        ],
        "luckyColor": "#9C27B0"
      },
      "Pisces": {
        "date": "2026-02-28",
        "quote": "Intuition is your superpower dressed in soft clothing.",
        "loveScore": 70,
        "workScore": 81,
        "healthScore": 76,
        "lovePrediction": "A spiritual or creative connection with someone new feels both familiar and thrillingly unknown. Your soul recognizes this meeting — trust the sacred feeling and follow its thread.",
        "workPrediction": "Imaginative work flourishes under your inspired guidance today. The solutions you generate feel almost magical to your more analytical colleagues, yet they are powerfully effective.",
        "luckyNumbers": [
          5,
          30,
          63,
          86,
          99
        ],
        "luckyColor": "#9C27B0"
      }
    }
  }
]
